-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-09-05 15:53:04
-- 伺服器版本： 10.4.20-MariaDB
-- PHP 版本： 8.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `taiwan`
--
CREATE DATABASE IF NOT EXISTS `taiwan` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;
USE `taiwan`;

-- --------------------------------------------------------

--
-- 資料表結構 `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL COMMENT '流水號',
  `cat_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '類別名稱',
  `parent_id` int(11) DEFAULT 0 COMMENT '上層編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `categories`
--

INSERT INTO `categories` (`id`, `cat_name`, `parent_id`, `created_at`, `updated_at`) VALUES
(1, '玉山', 0, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(2, '日月潭', 0, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(3, '環島', 0, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(4, '區域方案', 3, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(5, '7天行程', 4, '2021-08-20 14:26:57', '2021-08-23 22:37:52'),
(6, '14天行程', 4, '2021-08-20 14:26:57', '2021-08-23 22:37:57'),
(7, '北部出發', 4, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(8, '中部出發', 4, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(9, '東部出發', 4, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(10, '外島出發', 4, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(11, '踩點方案', 3, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(12, '北部出發', 11, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(13, '中部出發', 11, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(14, '東部出發', 11, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(15, '外島出發', 11, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(16, '裝備小屋', 0, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(17, '租賃', 16, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(18, '登山裝備', 17, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(19, '環潭裝備', 17, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(20, '其他', 17, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(21, '購買', 16, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(22, '登山裝備', 21, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(23, '環潭裝備', 21, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(24, '其他', 21, '2021-08-20 14:26:57', '2021-08-20 14:26:57'),
(25, '1+1+1', 0, '2021-08-20 14:26:57', '2021-08-20 14:26:57');

-- --------------------------------------------------------

--
-- 資料表結構 `coupon`
--

CREATE TABLE `coupon` (
  `email` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'Email',
  `code` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'coupon代碼',
  `code_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'code種類',
  `isUsed` tinyint(1) NOT NULL DEFAULT 0 COMMENT '是否被使用(0:無;1:有)',
  `percentage` float NOT NULL DEFAULT 0.1 COMMENT '原價百分比',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `omiyage`
--

CREATE TABLE `omiyage` (
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `prod_name` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品名稱',
  `prod_main_img` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品圖片',
  `prod_description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品敘述',
  `prod_price` int(11) DEFAULT NULL COMMENT '商品價格',
  `change_point` int(11) DEFAULT NULL COMMENT '兌換點數',
  `type_id` int(11) NOT NULL COMMENT '伴手禮種類'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `omiyage`
--

INSERT INTO `omiyage` (`prod_id`, `prod_name`, `prod_main_img`, `prod_description`, `prod_price`, `change_point`, `type_id`) VALUES
(1, '原味雪茄蛋捲禮盒7入', 'eggroll.png', '蛋捲製作中採用的每<br>\n一顆蛋皆有產銷履歷，堅持\n每天使用新鮮雞蛋製作蛋捲，營養百分百保留，非市面上常用的冷藏蛋液，其濃醇內餡與餅皮交織的纏綿幸福，絕對翻轉\n你對蛋捲的印象！', 0, 580, 1),
(2, '經典鳳梨酥脆禮盒(6入裝)', 'pineapplecake.png', '烈日下熟成的鳳梨經過削切、熬煮，酥皮是用健康飼養的鮮力蛋，天然奶油和日本麵粉揉成，無任何人工合成的添加。', 0, 720, 1),
(3, '宜蘭三星蔥燒餅4入禮盒組', 'yilan.png', '宜蘭蔥燒餅製作精細，最大特色是香、酥、脆，手工製作，內餡包宜蘭蔥、胡椒、五香粉及少許的鹽提味，手工捍平後，內餡不能外露，最後再灑上芝麻，烘烤完成的燒餅又酥又脆。', 0, 450, 1),
(4, '南投埔里頂級真空香菇1包', 'driedmushroom.png', '100%本土農產菇，朵朵飽滿的香菇，萃取日月精華，這神奇的口感，足以撼動您的感官。', 0, 490, 1),
(5, '台中太陽堂奶油小酥餅禮盒(6入裝)', 'suncake.png', '酥脆的餅皮，軟 Q 而不甜膩的餡，人口即化，富有濃濃的奶油香! 讓您一口接著一口。', 0, 290, 1),
(6, '防潑水可收納漁夫遮陽帽 ', 'hat.png', '防潑水面料可遮陽防曬，其內裡採用透氣孔洞設計，配戴舒適，是戶外活動必備的一頂帽子。', 0, 880, 2),
(7, '旅行必備輕便行李箱', 'luggage.png', '採用PC材質，一體成型的設計，超輕量行李箱是旅途中最佳的好夥伴', 0, 2980, 2),
(8, '時尚環保運動水壺', 'bottle.png', '利用不銹鋼與海洋再生塑料材質製成產品，高質感設計同時兼具環保元素', 0, 1200, 2),
(9, '富士 Quick Snap 即可拍相機', 'camera.png', '一次性底片相機，讓你輕鬆拍出復古文青照，留下旅遊的美好回憶！', 0, 450, 2),
(10, '輕量皮革質感包', 'bag.png', '內部簡約一體成型設計，讓您輕鬆背負無煩惱。', 0, 390, 2),
(11, '北投享溫泉免費兩小時使用券', 'hotspring1.png', '享溫泉備有冷熱池，盡享泡湯之餘又能保有隱私，快放下手上工作與紛擾。', 0, 1330, 3),
(12, '台北經典買一送一SPA按摩券', 'spa.png', '提供全身SPA按摩，舒緩緊繃的肌肉，排除體內淤積的毒素，讓您感受優質按摩的療效', 0, 2000, 3),
(13, '台南很溫馨KTV三小時兌換卷', 'singing.png', 'KTV界的南霸天，讓您在三小時內唱好唱滿', 0, 750, 3),
(14, '新竹星空探秘豪華露營之旅(一晚)', 'camping1.png', '免裝備露營，省去搭帳篷的不便，營區群山環抱、雲霧繚繞，宛如置身雲中秘境', 0, 3500, 3),
(15, '宜蘭珍奶文化館手搖珍奶DIY體驗', 'bubbletea.png', '前往宜蘭珍奶文化館，一探台灣名產珍珠奶茶的製作祕辛！', 0, 250, 3),
(16, '天地堂人文茶館大杯珍珠奶茶兌換券', 'bubbletea1.png', '沒喝過珍奶等於沒到過台灣，世界珍奶發源地-天地堂，為您製做一杯香濃好喝的珍奶！', 0, 100, 4),
(17, '真鮮精緻海陸鍋物一人份', 'hotpot.png', '頂級食材提供最鮮美的好滋味，內用外帶都提供，讓客人品嘗到最優質的餐點！', 0, 500, 4),
(18, '嘉義道地小吃林聰明沙鍋魚頭', 'fish.png', '嘉義特產獨家口味．擁有三代傳承的好滋味，您不能錯過林聰明沙鍋魚頭。', 0, 400, 4),
(19, '美華酒店精緻下午茶一人份', 'afternoontea.png', '酒店內提供的每個蛋糕皆帶有精緻的口感，喜愛吃甜食的您絕對不要錯過。', 0, 1290, 4),
(20, '高雄林皇宮LV百匯甜點吃到飽', 'strawberry.png', '每個草莓蛋糕都有好幾顆大草莓被夾在厚厚的奶油餡裡，吃起來濃郁又爽口。', 0, 990, 4),
(21, '原木單柄琺瑯牛奶鍋', 'pot.png', '硬質琺瑯塗層，不易掉色，同時擁有高抗酸鹼性及卓越的保溫性能。', 0, 990, 5),
(22, '大容量旅行收納背包(活力橘)', 'backpack.png', '大容量設計，背包內的夾層多，收納一目了然。', 0, 600, 5),
(23, '愛爾浦不銹鋼水壺(霧黑)', 'kettle.png', '快速煮沸、容易清潔 ，自動斷電安全系統。', 0, 1200, 5),
(24, '阿姆龍藍牙傳輸體重體脂計(白色)', 'scale.png', '消費者理想品牌，精準測量體脂肪率及基礎代謝。', 0, 1800, 5),
(25, '簡便瑜珈墊組( 瑜珈墊/瑜珈背帶/瑜珈袋)', 'yoga.png', '台灣獨家配色，瑜珈墊品質好、防滑度高。', 0, 450, 5);

-- --------------------------------------------------------

--
-- 資料表結構 `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL COMMENT '流水編號',
  `order_id` varchar(13) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '訂單編號',
  `email` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'email',
  `transport_payment` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '付款方式',
  `recipient_email` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者email',
  `recipient_first_name` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者名子',
  `recipient_last_name` varchar(11) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者姓氏',
  `gender` varchar(4) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '性別',
  `country` varchar(11) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '國家',
  `recipient_phone_number` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者手機號碼',
  `recipient_address` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者地址',
  `recipient_comments` text COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者備註',
  `coupon_code` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '優惠卷代碼',
  `card_number` varchar(16) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡號',
  `card_valid_date` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡到期年限',
  `card_ccv` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡',
  `card_holder` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡持有人',
  `total` int(11) DEFAULT NULL COMMENT '總額',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間',
  `invoice_carrier` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '發票載具',
  `invoice_carrier_number` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '發票載具編號'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `orders`
--

INSERT INTO `orders` (`id`, `order_id`, `email`, `transport_payment`, `recipient_email`, `recipient_first_name`, `recipient_last_name`, `gender`, `country`, `recipient_phone_number`, `recipient_address`, `recipient_comments`, `coupon_code`, `card_number`, `card_valid_date`, `card_ccv`, `card_holder`, `total`, `created_at`, `updated_at`, `invoice_carrier`, `invoice_carrier_number`) VALUES
(130, 'TW0000000002', 'okihanukus@gmail.com', '信用卡支付', 'okihanukus@gamil.com', '彥', '劉', '男', '台灣', '0912345678', '寶島', NULL, NULL, NULL, NULL, NULL, NULL, 14310, '2021-09-03 13:58:47', '2021-09-03 13:58:47', 'iCash', '000000000'),
(131, 'TW0000000003', 'okihanukus@gmail.com', '信用卡支付', 'okihanukus@gamil.com', '彥', '劉', '男', '台灣', '0912345678', '寶島', NULL, NULL, '1234123412341234', '0824', '123', 'CHIA-HAO CHEN', 13800, '2021-09-05 19:26:59', '2021-09-05 19:26:59', 'iCash', '000000000');

-- --------------------------------------------------------

--
-- 資料表結構 `orders_detail`
--

CREATE TABLE `orders_detail` (
  `order_id` varchar(13) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '訂單編號',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `func_name` varchar(4) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '租賃/購買',
  `prod_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品名稱',
  `prod_description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品敘述',
  `prod_main_img` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品圖片',
  `prod_price` int(11) DEFAULT NULL COMMENT '商品價格',
  `rental_charge` int(11) DEFAULT NULL COMMENT '商品租金',
  `rental_day` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '租借天數',
  `travel_day` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '旅遊時間',
  `prod_qty` int(11) DEFAULT NULL COMMENT '商品數量',
  `subtotal` int(11) DEFAULT NULL COMMENT '小計',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `orders_detail`
--

INSERT INTO `orders_detail` (`order_id`, `prod_id`, `func_name`, `prod_name`, `prod_description`, `prod_main_img`, `prod_price`, `rental_charge`, `rental_day`, `travel_day`, `prod_qty`, `subtotal`, `created_at`, `updated_at`) VALUES
('TW0000000002', 12, '0', '苗栗高山二週遊｜台版富士山 加里山 | 霞喀羅古道秘境 | 馬拉邦山 | 眺望聖稜線 | 棲蘭', '霞喀羅古道\r\n從養老登山口 22K 至白石吊橋 13.3K 即霞喀羅古道養老段，路徑坡度平緩，沿途景觀有孟宗竹林、楓香林二處景點令人難忘，春季可賞櫻花，12 月至隔年 1 月份秋冬季節時，古道上沿途有多處極佳的賞楓景點，尤其是在“馬鞍駐在所”遺址附近，是楓葉最集中的區域，是絕佳的賞楓景點\r\n栗園駐在所遺址\r\n霞喀羅古道於日治大正 10 年（1921 年）開闢，在霞喀羅事件之後逐步興建，路線橫跨今新竹縣尖石鄉與五峰鄉，由兩條警備道路所構成，在當時多為日本軍警理番之用。霞喀羅古道是由清泉向東，經民生、松本、石', 'n15-2.jpg', 3500, NULL, NULL, '2021-9-1 - 2021-9-4', 2, 7000, '2021-08-30 17:41:43', '2021-09-03 14:02:13'),
('TW0000000002', 14, '0', '北部二週遊 | XPARK | 蛋寶生技 | 日式鳥居 | 忠貞市場 | 馬祖新村 | 江戶忍者霧隱城 | 彩繪眷村 | 城隍廟美食 | 新竹動物園 | 小京都麗池公園', '由日本橫濱八景島首度跨海來台桃園開設分館「Xpark」，Xpark 主打新都會型水族館，驅使最先端的科技，營造出環境的溫度、濕度、氣味、聲音，帶您到地球上每個不可思議的角落，受到啟發、感受療癒、洗滌心靈！在 KKday 訂購 Xpark 入園門票，當日掃 QRcode 即可入館。\r\n', 'n23.jpg', 1450, NULL, NULL, '2021-9-1 - 2021-9-4', 1, 1450, '2021-08-30 17:41:43', '2021-09-03 14:02:16'),
('TW0000000002', 135, '17', '遮陽帽【白】', '彈性柔軟面料防潑水加工\r\n裡布保暖天鵝絨材質\r\n後有鬆緊繩束扣，可微調頭圍鬆緊度\r\n可拆式可調整鬆緊度頸繩設計\r\nLogo繡花設計', 'hat-white.jpg', NULL, 60, '2021-9-1 - 2021-9-4', NULL, 1, 60, '2021-08-30 17:41:43', '2021-08-30 17:41:43'),
('TW0000000002', 136, '17', 'Gore-Tex大背包縱走登山鞋【黃】', '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\r\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', 'hiking- boots-yellow.jpg', NULL, 1800, '2021-9-1 - 2021-9-4', NULL, 1, 1800, '2021-08-30 17:41:43', '2021-08-30 17:42:26'),
('TW0000000002', 214, '21', '連身套頭式雨衣【紅】', '*附收納袋方便收納，輕巧、不佔空間\r\n*抽繩可調整鬆緊，有帽沿設計\r\n*寬型蝴蝶袖口更靈活\r\n*防水係數 3000mm', 'rain-coat-red.jpg', 580, NULL, NULL, NULL, 1, 580, '2021-08-30 17:41:43', '2021-08-30 17:41:43'),
('TW0000000002', 220, '21', 'Black Diamond Trail 登山杖 ', '*360度環狀熱壓腕帶\r\n*輕量EVA防滑握把延伸至桿身\r\n*FlickLock快扣設計，方便迅速調節桿身尺寸\r\n*杖身刻度，依需求調整長度\r\n*附阻泥板與阻雪板\r\n*可更換鎢鋼杖尖', 'alpenstick.jpg', 3420, NULL, NULL, NULL, 1, 3420, '2021-08-30 17:41:43', '2021-08-30 17:41:43'),
('TW0000000003', 1, '0', '雙北尋訪七日｜藍色公路 | 漁人碼頭 | 永安漁港 | 賞蟹大道 | 淡水河遊船 | 大稻埕碼頭', '淡水漁人碼頭除了自行開車或搭乘大眾交通工具，騎YouBike也是一個健康的新選擇！打算造訪漁人舞台的民眾，不妨騎著YouBike悠遊淡水，除了探訪歷史悠久的「淡水老街」、「小白宮」、「淡水紅毛城」，也能造訪陶冶性情的「雲門劇場」及充滿日式風情的「多田榮吉故居」，追著海風到「漁人碼頭情人橋」捕捉無敵海景與全台最美夕照，最後在「淡水漁人舞台」吹著晚風、吃著烤肉、啜飲啤酒、隨音樂吶喊搖擺，參與一場熱情恣意的音樂趴踢，體驗全新的淡水風情。', 'n10.jpg', 13800, NULL, NULL, '2021-9-12 - 2021-9-13', 1, 13800, '2021-09-05 19:29:16', '2021-09-05 19:30:33');

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL COMMENT '流水編號',
  `func_name` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '租賃/購買',
  `prod_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品名稱',
  `prod_main_img` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品圖片',
  `prod_size` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品尺寸',
  `prod_price` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品價格',
  `rental_charge` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品租金',
  `rental_day` date DEFAULT NULL COMMENT '租借天數',
  `prod_description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品敘述',
  `location` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '地區',
  `feature_id` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '方案id',
  `cat_id` int(11) DEFAULT NULL COMMENT '類別編號',
  `cat_id_set` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '類別編號集合',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`id`, `func_name`, `prod_name`, `prod_main_img`, `prod_size`, `prod_price`, `rental_charge`, `rental_day`, `prod_description`, `location`, `feature_id`, `cat_id`, `cat_id_set`, `created_at`, `updated_at`) VALUES
(1, 'null', '雙北尋訪七日｜藍色公路 | 漁人碼頭 | 永安漁港 | 賞蟹大道 | 淡水河遊船 | 大稻埕碼頭', 'n10.jpg', 'null', '13800', NULL, NULL, '淡水漁人碼頭除了自行開車或搭乘大眾交通工具，騎YouBike也是一個健康的新選擇！打算造訪漁人舞台的民眾，不妨騎著YouBike悠遊淡水，除了探訪歷史悠久的「淡水老街」、「小白宮」、「淡水紅毛城」，也能造訪陶冶性情的「雲門劇場」及充滿日式風情的「多田榮吉故居」，追著海風到「漁人碼頭情人橋」捕捉無敵海景與全台最美夕照，最後在「淡水漁人舞台」吹著晚風、吃著烤肉、啜飲啤酒、隨音樂吶喊搖擺，參與一場熱情恣意的音樂趴踢，體驗全新的淡水風情。', 'Taipei', '5', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:32:35'),
(2, 'null', '北部史蹟巡禮七日｜九份 | 黃金博物館 | 太子賓館 | 至善園 | 慈湖 | 忠烈祠 | 基國派老教堂', 'n11.jpg', 'null', '4800', NULL, NULL, '被階梯圍繞山城之美鳥瞰基隆嶼，九份老街中充滿別具特色紀念品的店家 品嚐地方美食或悠閒品茶享受山與海美的天地。沿路上充滿懷舊古味建築風格讓人不禁駐足欣賞。夜晚繁星的點點燈火美麗山城景象，有種不同於白天的不夜情懷。', 'Taipei', '5', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:32:40'),
(3, 'null', '\n高雄七日｜大魯閣草衙道 | 鈴鹿賽道樂園 | 棒球打擊場', 't1.png', 'null', '3600', NULL, NULL, '日本鈴鹿賽車場唯一海外授權，全台第一座駕駛主題遊樂園\n鈴鹿賽道樂園緊鄰，交通便利，高雄必遊景點之一\n適合朋友、情侶或親子同遊，不分平假日，皆可使用無限暢遊券，方便又快速\n無限暢遊券或星光暢遊券任你選，日夜都好玩！', 'Kaohsiung', '5', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:34:37'),
(4, 'null', '高雄七日｜高雄旗津出發 | 西子灣夕陽 | 旗津渡輪 | 旗津老街美食', 't2.png', 'null', '7000', NULL, NULL, '旗津是高雄的人氣旅遊景點之一，很適合和西子灣一起安排個一日遊！旗津渡輪怎麼搭？除了旗津老街、彩虹教堂，旗津景點和西子灣景點還有哪些？怎麼規劃高雄旗津一日遊最順？有哪些推薦旗津美食？就趕快來看這篇高雄西子灣旗津一日遊吧！', 'Kaohsiung', '5', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:34:46'),
(5, 'null', '新北宜蘭七日｜東北角龍洞浮潛 | 彩石沙灘 | 賊仔澳秘境 | 潮境公園 | 鼻頭角步道 | 龜山島 | 夢幻牛奶海賞鯨豚 | 壯圍沙丘', 'n14.jpg', 'null', '7200', NULL, NULL, '巡遊台灣最富傳奇美麗的島嶼-龜山島，共同擁抱龜山島海域的碧海藍天以及欣賞美麗的鯨豚世界。悠閒在蒂芬尼藍的大海上，享受陽光吹著徐徐海風~敞洋龜山島周邊海底溫泉形成的獨特陰陽海，漸層牛奶色海域，超夢幻的啦~', 'Yilan', '5', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:33:09'),
(6, 'null', '北部高山七日｜碧潭 | 烏來溫泉 | 馬告生態園區 | 棲蘭 | 松蘿湖 | 加羅湖|南湖大山|思源啞口 | 武陵 | 雪霸國家公園', 'p4.png', 'null', '4800', NULL, NULL, '武陵地區位於台灣中部，是由雪山山脈圍繞而成高海拔山區，環山環繞、谷豁棋布，武陵蘊藏種類繁多的植物相，山水間綠意盎然，孕育著蟲鳥魚獸等豐富的野生動物資源，看山林，見水石，婀娜的曲流，寬懷的繚繞，繞出了武陵地區盎然的生命力！ 秋季的武陵農場是賞楓勝地，春季更是台灣有名的櫻花林區！來武陵見證他四季不同的森林面貌！', 'Taipei', '5', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:33:17'),
(7, 'null', '金門七日 | 金門海人體驗｜撿海螺｜挖花蛤｜海港岩岸垂釣｜', 'n14-2.jpg', 'null', '3220', NULL, NULL, '金門四面環海，因為無工業所以是座無污染的城市，而金門南面，從后湖往西南經泗湖到歐厝，有著綿延數十公里的沙灘，除了可以戲水漫步，更常見的是當地人拿著水桶和鏟子，蹲在地上挖蛤仔、撿海螺、或是齊坐一塊剝石蚵；日落時分還能在岩岸海港一邊垂釣一邊欣賞夕陽美景。透過 KKday 訂購金門漁村特殊體驗，替金門旅程留下美好的回憶。', 'Kinmen', '5', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:33:29'),
(8, 'null', '菊島采風七日｜七美浮潛｜海洋牧場｜ 快樂渡假村', 'n3-1.jpg', 'null', '4210', NULL, NULL, '金門四面環海，因為無工業所以是座無污染的城市，而金門南面，從后湖往西南經泗湖到歐厝，有著綿延數十公里的沙灘，除了可以戲水漫步，更常見的是當地人拿著水桶和鏟子，蹲在地上挖蛤仔、撿海螺、或是齊坐一塊剝石蚵；日落時分還能在岩岸海港一邊垂釣一邊欣賞夕陽美景。透過 KKday 訂購金門漁村特殊體驗，替金門旅程留下美好的回憶。', 'Kinmen', '5', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:33:36'),
(9, 'null', '台北二週遊｜鳴日好觀光列車深遊北台灣 | 傳藝歌仔戲 | 深入太巴塱部落 | 商務酒店', 'n18.jpg', 'null', '3000', NULL, NULL, '位在光復鄉的太巴塱部落，在阿美族語有螃蟹的意思，因此在部落中處處可見生動的木雕螃蟹圖騰。這裡不僅保留阿美族傳統家屋、部落刀槍、酒皿等文物，還是全臺唯一生產紅糯米的產地，如此珍貴的部落傳統糧食，讓太巴塱部落成立紅糯米文化館、舉辦紅糯米文化祭，給旅客體驗祭典的熱鬧，以及品嘗部落風味料理。', 'Taipei', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:33:41'),
(10, 'null', '台北二週遊｜玻璃館 | 鹿港天后宮 | 雪白夢幻韭菜花田 | 鮮採柚子體驗 | 竹南啤酒廠|知名團購美食買個夠', 'n19.jpg', 'null', '1680', NULL, NULL, '鹿港天后宮，又稱鹿港媽祖宮、鹿港湄洲媽，前身為鹿港天妃廟，是鹿港地區的信仰中心，是臺灣最早唯一奉祀湄洲島湄洲天后宮天上聖母開基聖母神尊的廟宇，此尊湄洲島天上聖母（開基二媽）是明末清初福建水師提督施琅將軍奉請帶來的，也是臺灣僅存的第一尊來臺灣的湄洲開基天上聖母，更是臺灣歷史悠久的知名廟宇之一，至今將近四百多年，目前由中華民國文化部評定為國定古蹟，位在臺灣彰化縣鹿港鎮的中山路430號上。', 'Taipei', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:33:49'),
(11, 'null', '宜蘭二週遊 | 不老部落探訪 | 林美石磐步道 | 五結無菜單料理 | 船遊東澳灣粉鳥林 | 煙波蘇澳四季雙泉館', 'n20.jpg', 'null', '2400', NULL, NULL, '在山上工作是我們最快樂的，每天與大自然為伍，社會紛擾很遙遠。\n就地取材，遷就大自然，建構農牧山居，工作累了，青蛙、蟋蟀合奏樂曲讓我們休息，\n螢火蟲從窗外飛進蚊帳讓我看到曬黑的枕邊人是否甜睡，不用冷氣，一覺到清晨，\n山雞、紅山椒、五色鳥，全部都在週旁叫你起床吃早餐，\n早上鮮撿雞蛋，小米作的餅，跟小羊要來的奶，新鮮蔬果沙拉，讓活力從清晨直到黃昏。', 'Yilan', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:33:54'),
(12, 'null', '苗栗高山二週遊｜台版富士山 加里山 | 霞喀羅古道秘境 | 馬拉邦山 | 眺望聖稜線 | 棲蘭', 'n15-2.jpg', 'null', '3500', NULL, NULL, '霞喀羅古道\n從養老登山口 22K 至白石吊橋 13.3K 即霞喀羅古道養老段，路徑坡度平緩，沿途景觀有孟宗竹林、楓香林二處景點令人難忘，春季可賞櫻花，12 月至隔年 1 月份秋冬季節時，古道上沿途有多處極佳的賞楓景點，尤其是在“馬鞍駐在所”遺址附近，是楓葉最集中的區域，是絕佳的賞楓景點\n栗園駐在所遺址\n霞喀羅古道於日治大正 10 年（1921 年）開闢，在霞喀羅事件之後逐步興建，路線橫跨今新竹縣尖石鄉與五峰鄉，由兩條警備道路所構成，在當時多為日本軍警理番之用。霞喀羅古道是由清泉向東，經民生、松本、石鹿等部', 'Miaoli ', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:34:00'),
(13, 'null', '台北老街二週遊｜北部必去老街 湖口老街 | 大溪老街 | 鶯歌老街 | 九份老街 | 三峽老街 | 內灣老街 | 湖口老街 | 三坑老街', 'n8-1.jpg', 'null', '1680', NULL, NULL, '立即預訂新北九份拼車一日遊，台北車站出發，前往新北郊區開啟悠閒的一日。漫步在位於瑞芳的茶壺山步道，是金瓜石的最佳地標，亦是金瓜石最具代表性的精神象徵。午間前往九份老街，走在復古小徑，漫遊可愛的攤販間品嚐台灣正港小吃的美味。。午後前往新北市立黃金博物館，館內展示昔日礦業發展的發展歷史，不遺餘力的推廣人文遺產的保存與教育。北台灣的必訪地點，一定不能錯過象鼻岩，這裡台灣 36 秘境之一，特殊的黃土地形與藍天白雲形成一片最吸睛的美景，同時擁有絕美海景的觀景處，總是吸引了許多旅人駐足於此。現在預訂新北九份拼車一日遊', 'Taipei', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:34:08'),
(14, 'null', '北部二週遊 | XPARK | 蛋寶生技 | 日式鳥居 | 忠貞市場 | 馬祖新村 | 江戶忍者霧隱城 | 彩繪眷村 | 城隍廟美食 | 新竹動物園 | 小京都麗池公園', 'n23.jpg', 'null', '1450', NULL, NULL, '由日本橫濱八景島首度跨海來台桃園開設分館「Xpark」，Xpark 主打新都會型水族館，驅使最先端的科技，營造出環境的溫度、濕度、氣味、聲音，帶您到地球上每個不可思議的角落，受到啟發、感受療癒、洗滌心靈！在 KKday 訂購 Xpark 入園門票，當日掃 QRcode 即可入館。\n2021 年夏天，面對陣陣酷暑熱浪，日本人用獨有的角度與文化，編織出了專屬東洋的夏季光景，只有在 Xpark 看得見，和可愛生物一起創造不一樣的 Summer memories！', 'Taipei', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:34:19'),
(15, 'null', '台北二週遊｜圓山國宴 | 烏石港海景酒店 | 大板根森林溫泉酒店 | 萬里蟹無菜單料理 | 五星六福萬怡', 'n24.jpeg', 'null', '3240', NULL, NULL, '大板根的原生亞熱帶雨林，全臺唯一僅存的中低海拔原生亞熱帶雨林，區內有許多令人歎為觀止的大型板根，蔓生數百年以上的巨藤和高聳入雲的林海等豐富的生態組合！稱得上是一座「亞熱帶雨林植物寶窟」！\n十餘年來在經營者的保育耕耘下，才得以讓這個以千百年歲月形成的亞熱帶雨林奇觀，成為台灣在國際生態保育與森林觀光中最大的驕傲！', 'Taipei', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:34:26'),
(16, 'null', '台北二週遊｜商務郵輪離島假期 | 巡遊北台灣離島之旅2週', 'n25.jpg', 'null', '2400', NULL, NULL, '基隆港為台灣第二大港口，也是台灣北部最重要的海運樞紐，並在光緒12 年(1886年)，基隆港正式開 放為商港。從1899年，到1935年間共四期的基隆港築港工程，興建了大型造船廠及軍港、漁港區。從碼頭倉庫到港區鐵路等設施皆相當完備，這四期的築港工程，不但奠定了日後基隆港的發展基礎，也使基隆港在1970年代前，穩坐台灣第一大港寶座；到了1984年時更成為世界第七大貨櫃港。1980年代之後為了提升競爭力，基隆港開始轉型為結合觀光、親水性之港口。在2003年時也設立了自由貿易港區。', 'Taipei', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:34:55'),
(17, 'null', '花蓮二週遊｜楓林秘境、魔幻山姆小屋鐵道', 'east-21.jpeg', 'null', '1200', NULL, NULL, '體驗植物拓印ＤＩＹ：認識植物的特性與葉片的紋理與用途，並用小槌子在拼布上拓印出葉子圖案', 'Hualien', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:04'),
(18, 'null', '花蓮二週遊｜蝴蝶谷森呼吸、瑞穗牧場、太魯閣、鐵道', 'east-22.jpeg', 'null', '2600', NULL, NULL, '太魯閣國家公園以雄偉壯麗、幾近垂直的大理岩峽谷景觀聞名。沿著立霧溪的峽谷風景線而行，觸目所及皆是壁立千仞的峭壁、斷崖、峽谷、連綿曲折的山洞隧道、大理岩層和溪流等風光。', 'Hualien', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:13'),
(19, 'null', '花東二週遊｜山海戀加路蘭海岸藝術、月光小棧、瑞穗天合歐風城堡頂級黃金風呂', 'east-23.jpeg', 'null', '3000', NULL, NULL, '暢遊台東山海秘境景點、瑞穗天合歐風莊園金色水樂園溫泉設施、讓您有時間不趕 慢漫遊台東鐵花村音樂聚落慢市集波浪屋~真正達到放鬆的效果。', 'Hualien', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:18'),
(20, 'null', '花東二週遊｜尊爵典藏花東山海縱谷樂遊', 'east-24.jpeg', 'null', '4000', NULL, NULL, '串聯花東海岸及花東縱谷，連結一氣；無接縫旅遊增加遊客觀光便利性；讓您輕鬆體驗花東山海之美。', 'Hualien', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:24'),
(21, 'null', '花東二週遊｜太魯閣、知本湯泉養生、墾丁海洋南迴雙鐵典藏', 'east-25.jpeg', 'null', '3200', NULL, NULL, '串聯花東海岸及花東縱谷，連結一氣；無接縫旅遊增加遊客觀光便利性；讓您輕鬆體驗花東山海之美。	', 'Hualien', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:30'),
(22, 'null', '台東二週遊｜縱谷海岸地景藝術、知本老爺風呂饗宴', 'east-26.jpeg', 'null', '5000', NULL, NULL, '雙鐵+觀巴輕鬆暢遊太魯閣墾丁雙國家主題公園、花東縱谷享受知本溫泉美食。', 'Taitung', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:40'),
(23, 'null', '台東二週遊｜知本老爺太麻里最美多良海岸旭海牡丹灣秘境', 'east-27.jpeg', 'null', '4500', NULL, NULL, '山海精選主題遊：卑南大圳大峽谷、加母子灣(椰林涼亭.海灣)、月光小站、池上裝置藝術、瑞和火車站、鹿野高台、精選舒適交通便利台東飯店 + 知本美人湯饗放鬆渡假。', 'Taitung', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:45'),
(24, 'null', '花東二週遊｜縱谷山海、世紀湯饗鐵道', 'east-28.jpeg', 'null', '2000', NULL, NULL, '牡丹灣VILLA猶如巴里島度假般~在半開放木造空間享用全天候免費提供的現榨果汁或香醇咖啡手沖青草茶、及手工餅乾愜意度過優閒午后或是在室內湯池享受熱氣蒸騰的溫暖，抑或是步入室外湯池，感受野溪溫泉獨有的自然冷暖暢快，都是「溫泉水滑洗凝脂」的貴妃享受。晚餐於湖畔樓餐廳享用每日精選當地特產及漁港現撈魚獲創作出的精緻原味美食晚宴。', 'Taitung', '6', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:50'),
(25, 'null', '雙北尋訪七日｜藍色公路 | 漁人碼頭 | 永安漁港 | 賞蟹大道 | 淡水河遊船 | 大稻埕碼頭', 'n10.jpg', 'null', '5490', NULL, NULL, '臺北市的淡水河、基隆河，自古就是貨運或是通勤者渡船的藍色水路。現今則轉變為搭載觀光客的水上觀光道路。', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:35:56'),
(26, 'null', '北部史蹟巡禮七日｜九份 | 黃金博物館 | 太子賓館 | 至善園 | 慈湖 | 忠烈祠 | 基國派老教堂', 'n11.jpg', 'null', '3400', NULL, NULL, '建於民國52年，做為啟蒙與教化泰雅原住民的起點，「基國派老教堂」是一個相當有特色的建築，教堂座落於讀法阿（Tuba）部落內，是當時的部落長老發動族人自動自發所興建。原本教堂屋頂採竹材興建，但因當時的防腐技術不足，五、六年後教堂就失修損壞，爾後在美國傳教士孫雅各牧師的建議之下，改採用蝙蝠洞一帶的溪河岸石興建，造就成今日堅固又有特色的樣貌。', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:36:25'),
(27, 'null', '北部七日 | 南澳金岳瀑布溯溪 | 千島湖 | 八卦茶園 | 永安步道 | 石碇秘境塗潭', 'n12.jpg', 'null', '8000', NULL, NULL, '北宜公路一直是台北通往宜蘭的重要管道，全長82.5公里，共橫越新北市新店區、石碇區、坪林區，經二城、礁溪至終點宜蘭，編屬９號省道，是一條驚險又美麗的道路！自從雪隧通車後，這裡就成了單車客和重機車友的最愛了！還記得那九彎十八拐的大迴彎嗎！，每一彎都有美景可以看，', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:36:33'),
(28, 'null', '新北宜蘭七日｜烏來 | 礁溪祕境健行 | 桶後越嶺古道 | 東眼山 | 太平山森林遊樂區等', 'n13.jpg', 'null', '4020', NULL, NULL, '太平山國家森林遊樂區位於台灣東北部的宜蘭縣境內，轄屬於大同鄉及南澳鄉，為林務局羅東林區管理處所管轄。自2011年起，區內餐飲、住宿、販賣部、溫泉及蹦蹦車等服務設施，從原本由羅東林管處職工福利會經營，全面改為羅東林管處(公部門)直接經營，所有營收均入國庫。整個太平山區幅員廣大，面積廣達12,930公頃，包括土場、仁澤(鳩之澤)、中間、白嶺、太平山、茂興、翠峰湖等據點。太平山國家森林遊樂區林木蓊鬱、群山青翠的景象，區內有溫泉、雲海、雪景、瀑布、湖泊等豐富的景觀資源，以及瀰漫林間、充滿芬多精與陰離子的清新空氣，', 'Yilan', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:36:39'),
(29, 'null', '新北宜蘭七日｜東北角龍洞浮潛 | 彩石沙灘 | 賊仔澳秘境 | 潮境公園 | 鼻頭角步道 | 龜山島 | 夢幻牛奶海賞鯨豚 | 壯圍沙丘', 'n14.jpg', 'null', '8400', NULL, NULL, '壯圍沙丘旅遊服務園區位於臺2線濱海公路149.3K旁，面積約4.8公頃，為宜蘭國際魅力新景點。園區由名建築師黃聲遠，以「空出谷地，看見沙丘」為核心概念規劃設計，融合宜蘭地方自然元素呈現沙丘地景風貌及沙穴建築空間營造，走在園區一旁是寧靜的鄉村田野，一旁是池水倒映著天氣變化和綿延的林投樹樹梢，不但景致襯托出壯圍沙丘旅遊服務園區的美景，眼前起伏廣大沙丘景色，讓人不自覺地會放慢腳步。', 'Yilan', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:37:22'),
(30, 'null', '北部高山七日｜碧潭 | 烏來溫泉 | 馬告生態園區 | 棲蘭 | 松蘿湖 | 加羅湖|南湖大山|思源啞口 | 武陵 | 雪霸國家公園', 'n8-2.jpg', 'null', '12000', NULL, NULL, '雪霸國家公園位居臺灣島中北部的雪山山脈，區內高山林立，風景壯麗。雪山、大霸尖山及聖陵線等崇峻高山及其自然地形景觀，蘊藏重要生物種類及族群，不僅有臺灣獨一無二國寶魚櫻花鉤吻鮭及觀霧山椒魚等保育物種，是一座自然資源極為豐富的國家公園。區內登山步道提供生態旅遊活動，滿足國民遊憩需求，是享受優美景觀與豐富自然資源的最佳場所。', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:37:30'),
(31, 'null', '台北七日｜黃金博物館 | 深坑老街 | 貓空纜車 | 傳統藝術中心 | 茶業博物館|菁桐車站', 'n16.jpg', 'null', '6499', NULL, NULL, '平溪線鐵路帶動了沿線聚落的發展，從十分、平溪到菁桐，各個聚落都有因礦業發展而曾經繁榮過的痕跡。在礦業停產後，人口也隨之流失，平溪山城曾經沒落過一時，不過隨著轉型發展觀光，礦業園區與放天燈、桐花與螢火蟲、登山健行與戲水等等重新帶動起了平溪四季的繁榮。而菁桐車站是平溪線的終點，更是許多搭乘平溪線列車來菁桐的旅客，所遇見的第一個地標。', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:37:36'),
(32, 'null', '北部七日｜苗栗天空之城花露農場 | 蘭花館 | 精油城堡 | 苗栗景觀餐廳 | 壢西坪休閒農業區 | 七里香玫瑰森林等', 'n17.jpg', 'null', '5488', NULL, NULL, '苗栗以農立縣並有山城之稱，擁有各類特殊景觀及豐富的農特產品，更依地方農產資源為基礎，配合周邊的特色景觀、生態及文化劃設了十大休閒農業區；整合各休區日常及季節版農遊特色，安排以下農遊路線，等待您放下腳步，來一場說走就走的慢食、漫活的苗栗農村旅遊，細細品味苗栗的花、果、茶香。\n', 'Miaoli ', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:37:44'),
(33, 'null', '台北七日｜黃金博物館 | 深坑老街 | 貓空纜車 | 傳統藝術中心 | 茶業博物館|菁桐車站', 'n18.jpg', 'null', '7200', NULL, NULL, 'null', 'Taipei ', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:37:52'),
(34, 'null', '台北二週遊｜玻璃館 | 鹿港天后宮 | 雪白夢幻韭菜花田 | 鮮採柚子體驗 | 竹南啤酒廠|知名團購美食買個夠', 'n19.jpg', 'null', '3499', NULL, NULL, 'null', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:37:58'),
(35, 'null', '宜蘭七日 | 不老部落探訪 | 林美石磐步道 | 五結無菜單料理 | 船遊東澳灣粉鳥林 | 煙波蘇澳四季雙泉館', 'n20.jpg', 'null', '4112', NULL, NULL, 'null', 'Yilan', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:04'),
(36, 'null', '苗栗高山七日｜台版富士山 加里山 | 霞喀羅古道秘境 | 馬拉邦山 | 眺望聖稜線 | 棲蘭', 'n21.jpg', 'null', '4789', NULL, NULL, 'null', 'Miaoli ', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:11'),
(37, 'null', '台北老街七日｜北部必去老街 湖口老街 | 大溪老街 | 鶯歌老街 | 九份老街 | 三峽老街 | 內灣老街 | 湖口老街 | 三坑老街', 'n22.jpg', 'null', '3200', NULL, NULL, 'null', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:16'),
(38, 'null', '北部二週遊 | XPARK | 蛋寶生技 | 日式鳥居 | 忠貞市場 | 馬祖新村 | 江戶忍者霧隱城 | 彩繪眷村 | 城隍廟美食 | 新竹動物園 | 小京都麗池公園', 'n23.jpg', 'null', '3200', NULL, NULL, 'null', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:22'),
(39, 'null', '台北二週遊｜圓山國宴 | 烏石港海景酒店 | 大板根森林溫泉酒店 | 萬里蟹無菜單料理 | 五星六福萬怡', 'n24.jpg', 'null', '5000', NULL, NULL, 'null', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:26'),
(40, 'null', '台北二週遊｜商務郵輪離島假期 | 巡遊北台灣離島之旅2週', 'n25.jpg', 'null', '3200', NULL, NULL, 'null', 'Taipei', '7', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:34'),
(41, 'null', '高雄七日｜大魯閣草衙道 | 鈴鹿賽道樂園 | 棒球打擊場', 't1.png', 'null', '2480', NULL, NULL, 'null', 'Kaohsiung', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:42'),
(42, 'null', '高雄七日｜高雄旗津出發 | 西子灣夕陽 | 旗津渡輪 | 旗津老街美食', 't2.png', 'null', '4022', NULL, NULL, 'null', 'Kaohsiung', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:47'),
(43, 'null', '高雄七日｜夢時代廣場 | 高雄之眼摩天輪 | 凱旋觀光夜市', 't3.jpg', 'null', '4399', NULL, NULL, 'null', 'Kaohsiung', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:38:53'),
(44, 'null', '高雄七日｜駁二藝術特區 | KW2 棧貳庫 | 哈瑪星鐵道文化園區', 't4.jpg', 'null', '6789', NULL, NULL, 'null', 'Kaohsiung', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:00'),
(45, 'null', '南投七日｜鹿港老街 | 竹山紫南宮 | 灣麻糬主題館', 't5.jpg', 'null', '3400', NULL, NULL, 'null', 'Nantou', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:05'),
(46, 'null', '高雄七日｜暢遊龍虎塔 | 眷村園區 | 蓮池潭悠閒之旅', 't6.jpg', 'null', '2999', NULL, NULL, 'null', 'Kaohsiung', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:13'),
(47, 'null', '嘉義七日｜高跟鞋教堂 | 布袋漁市 | 周邊小吃', 't7.jpg', 'null', '3999', NULL, NULL, 'null', 'Chiayi', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:17'),
(48, 'null', '高雄七日｜西子灣 | 鼓山海水浴場 | 打狗英國領事館', 't8.jpg', 'null', '1999', NULL, NULL, 'null', 'Kaohsiung', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:21'),
(49, 'null', '南投二週遊｜日月潭國家風景區 | 紙教堂 | 紙農書院', 't9.jpg', 'null', '2000', NULL, NULL, 'null', 'Nantou', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:28'),
(50, 'null', '南投二週遊｜紙教堂新故鄉見學園區 | 日月老茶廠 | 港寮枝179景觀農場', 't10.png', 'null', '3020', NULL, NULL, 'null', 'Nantou', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:46'),
(51, 'null', '高雄二週遊｜旗津渡船 | 旗津老街 | 彩虹教堂 | 旗后燈塔', 't11.png', 'null', '2180', NULL, NULL, 'null', 'Kaohsiung', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:51'),
(52, 'null', '高雄二週遊｜寶來花賞溫泉公園 | 山望月溫泉風呂露營區 | 溫泉美食', 't12.png', 'null', '4200', NULL, NULL, 'null', 'Kaohsiung', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:39:55'),
(53, 'null', '嘉義二週遊｜阿里山茶園景觀 | 採茶體驗 | 碧湖觀景台', 't13.png', 'null', '1266', NULL, NULL, 'null', 'Chiayi', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:40:01'),
(54, 'null', '嘉義二週遊｜日出祝山線 | 小笠原山觀景台 | 阿里山日出', 't14.png', 'null', '1899', NULL, NULL, 'null', 'Chiayi', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:40:08'),
(55, 'null', '嘉義二週遊｜沼平火車站 | 阿里山賞櫻花 | 景觀民宿', 't15.png', 'null', '900', NULL, NULL, '粉色櫻花灑滿整個阿里山頭，從平地慢慢往山頭使去的路上，每一公里的景色都有所不同。在阿里山賞櫻格外有感覺，你可以在櫻花樹下品茗，抑或走在高山茶園間，眺望山頭滿是春色。', 'Chiayi', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:40:12'),
(56, 'null', '嘉義二週遊｜阿里山森林小火車 | 阿里山步道 | 日出商店', 't16.png', 'null', '1200', NULL, NULL, '來到阿里山絕對不能沒搭過小火車，阿里山小火車從日治時期一直使用至今，從載運木頭到現在載運遊客，讓遊客在搭乘小火車的途中欣賞沿途的美景、感受鐵路工法的奧妙。', 'Chiayi', '8', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:40:18'),
(57, 'null', '台東七日｜太麻里金針花賞、知本老爺風呂饗', 'east-14.jpeg', 'null', '8000', NULL, NULL, '台東自由漫步、特別安排舒適交通便利台東飯店、達人帶您賞太麻里金針花、 知本美人湯饗放鬆渡假。', 'Taitung', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:40:27'),
(58, 'null', '宜蘭七日｜太平山莊蹦蹦車、見晴步道翠峰湖森林', 'east-15.jpeg', 'null', '3200', NULL, NULL, '林木蓊鬱、群山青翠的景象，區內有溫泉、雲海、雪景、瀑布、湖泊等豐富的景觀資源，以及瀰漫林間、充滿芬多精與陰離子的清新空氣，是民眾走向自然、從事森林育樂與戶外活動的最好場域。', ' Yilan', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:40:32'),
(59, 'null', '宜蘭七日｜落雨松、三星採蔥DIY、羅東夜市', 'east-16.jpeg', 'null', '1899', NULL, NULL, '採蔥、拔蔥、洗蔥體驗、蔥油餅DIY，大把的新鮮三星蔥盡量放，不用擔心！在農場主人的經驗教學下，怎麼樣做出好吃蔥油餅的秘訣，在這裡通通教給您～', ' Yilan', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:40:38'),
(60, 'null', '宜蘭七日｜明池森林童話、馬告生態探索', 'east-17.jpeg', 'null', '2999', NULL, NULL, '暢遊全台最密集神木群的棲蘭一百神木群，擁有近百棵千年以上的紅檜與台灣扁柏，恰似遠古初創時期，邀遊歷史、走進自然，讓您更了解神木群的故事。', ' Yilan', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:40:42'),
(61, 'null', '花蓮七日｜太魯閣峽谷山月吊橋、海洋田園縱谷自選親子遊', 'east-18.jpeg', 'null', '4200', NULL, NULL, '太魯閣熱門景點: 最氣勢磅礡的山月吊橋 、令人讚嘆震懾的九曲洞步道。', 'Hualien', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:41:32'),
(62, 'null', '花蓮七日｜獵人手作DIY、鯉魚潭、東海岸天空步道、新社梯田', 'east-19.jpeg', 'null', '3200', NULL, NULL, '親子旅遊主推體驗馬拉桑獵人學校獵人課程：體驗道地的阿美族飲食及文化，獵人教練們細心指導課程，讓您體驗到不同的生活型態，大小朋友體驗原住民風情及竹筒飯DIY，樂趣十足。	', 'Hualien', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:41:38'),
(63, 'null', '花蓮七日｜太魯閣縱谷、親不知子天空步道、新社梯田、魅力景點鐵道', 'east-20.jpeg', 'null', '1400', NULL, NULL, '太魯閣國家公園：太魯閣國家公園以雄偉壯麗、幾近垂直的大理岩峽谷景觀聞名。沿著立霧溪的峽谷風景線而行，觸目所及皆是壁立千仞的峭壁、斷崖、峽谷、連綿曲折的山洞隧道、大理岩層和溪流等風光。', 'Hualien', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:41:43'),
(64, 'null', '花蓮七日｜太魯閣九曲洞、夢幻縱谷金針花賞、瑞穗天合歐風城堡黃金湯', 'east-1.jpeg', 'null', '3200', NULL, NULL, '遊太魯閣世界聞名的峽谷景觀、花東縱谷線上最知名的光復糖廠日式懷舊風及每年7-8月份的金針花賞、入住瑞穗天合國際觀光酒店玩黃金水樂園+遊莊園。', 'Hualien', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:41:52'),
(65, 'null', '\n攀登玉山3天2夜登山行程｜入住排雲山莊｜攻略東北亞第一高峰', 'yushan_01.jpg', 'null', '9999', NULL, NULL, '您身為台灣人一生，一定要爬上玉山主峰3952公尺拍照留念，下輩子才會再生為台灣人，寶島旅人瘋一定幫您完成夢想。', 'null', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-27 10:49:28'),
(66, 'null', '花蓮二週遊｜蝴蝶谷森呼吸、瑞穗牧場、太魯閣、鐵道', 'east-22.jpeg', 'null', '1399', NULL, NULL, '太魯閣國家公園以雄偉壯麗、幾近垂直的大理岩峽谷景觀聞名。沿著立霧溪的峽谷風景線而行，觸目所及皆是壁立千仞的峭壁、斷崖、峽谷、連綿曲折的山洞隧道、大理岩層和溪流等風光。', 'Hualien', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:03'),
(67, 'null', '花東二週遊｜山海戀加路蘭海岸藝術、月光小棧、瑞穗天合歐風城堡頂級黃金風呂', 'east-23.jpeg', 'null', '2499', NULL, NULL, '暢遊台東山海秘境景點、瑞穗天合歐風莊園金色水樂園溫泉設施、讓您有時間不趕 慢漫遊台東鐵花村音樂聚落慢市集波浪屋~真正達到放鬆的效果。	', 'Hualien', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:07'),
(68, 'null', '花東二週遊｜尊爵典藏花東山海縱谷樂遊', 'east-24.jpeg', 'null', '3988', NULL, NULL, '串聯花東海岸及花東縱谷，連結一氣；無接縫旅遊增加遊客觀光便利性；讓您輕鬆體驗花東山海之美。', 'Hualien', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:12'),
(69, 'null', '花東二週遊｜太魯閣、知本湯泉養生、墾丁海洋南迴雙鐵典藏', 'east-25.jpeg', 'null', '4200', NULL, NULL, '雙鐵+觀巴輕鬆暢遊太魯閣墾丁雙國家主題公園、花東縱谷享受知本溫泉美食。', 'Hualien', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:16'),
(70, 'null', '台東二週遊｜縱谷海岸地景藝術、知本老爺風呂饗宴', 'east-26.jpeg', 'null', '5200', NULL, NULL, '山海精選主題遊：卑南大圳大峽谷、加母子灣(椰林涼亭.海灣)、月光小站、池上裝置藝術、瑞和火車站、鹿野高台、精選舒適交通便利台東飯店 + 知本美人湯饗放鬆渡假。', 'Taitung', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:23'),
(71, 'null', '台東二週遊｜知本老爺太麻里最美多良海岸旭海牡丹灣秘境', 'east-27.jpeg', 'null', '5200', NULL, NULL, '牡丹灣VILLA猶如巴里島度假般~在半開放木造空間享用全天候免費提供的現榨果汁或香醇咖啡手沖青草茶、及手工餅乾愜意度過優閒午后或是在室內湯池享受熱氣蒸騰的溫暖，抑或是步入室外湯池，感受野溪溫泉獨有的自然冷暖暢快，都是「溫泉水滑洗凝脂」的貴妃享受。晚餐於湖畔樓餐廳享用每日精選當地特產及漁港現撈魚獲創作出的精緻原味美食晚宴。	', 'Taitung', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:27'),
(72, 'null', '花東二週遊｜縱谷山海、世紀湯饗鐵道', 'east-28.jpeg', 'null', '3200', NULL, NULL, '串聯花東海岸及花東縱谷； 無接縫旅遊增加遊客觀光便利性；讓您輕鬆體驗花東山海之美。', 'Taitung', '9', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:31'),
(73, 'null', '金門七日 | 金門海人體驗｜撿海螺｜挖花蛤｜海港岩岸垂釣｜', 'i-1.jpg', 'null', '5399', NULL, NULL, 'null', 'Kinmen', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:37'),
(74, 'null', '蘭嶼七日｜夜間生態觀察｜潮間帶｜達悟文化', 'i-2.jpg', 'null', '4200', NULL, NULL, 'null', 'Orchid Island', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:42'),
(75, 'null', '菊島采風七日｜七美浮潛｜海洋牧場｜ 快樂渡假村', 'i-3.jpg', 'null', '6000', NULL, NULL, 'null', 'Orchid Island', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:45'),
(76, 'null', '小琉球七日｜島上最著名的大地標小琉球杉板灣沙灘', 'i-4.jpg', 'null', '5699', NULL, NULL, 'null', 'Ryukyu', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:42:49'),
(77, 'null', '綠島七日 | 藍洞秘境跳水｜瀑布｜彎弓洞', 'i-5.jpg', 'null', '4200', NULL, NULL, 'null', 'Green Island', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:04'),
(78, 'null', '小金門二週遊 | 百年風獅爺＆沙溪堡＆紅土溝', 'i-6.jpg', 'null', '10000', NULL, NULL, 'null', 'Kinmen', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:15'),
(79, 'null', '澎湖二週遊｜龍蝦島、帆船SUP、透明獨木舟三日', 'i-7.jpg', 'null', '2000', NULL, NULL, 'null', 'Penghu', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:19'),
(80, 'null', '澎湖二週遊｜東海巡航龍蝦島｜海洋牧場｜元泰大飯店', 'i-8.jpg', 'null', '4000', NULL, NULL, 'null', 'Penghu', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:22'),
(81, 'null', '蘭嶼二週遊｜浮潛｜ 自在采風 ｜海洋浮潛體驗｜水上活動推薦', 'i-9.jpg', 'null', '3200', NULL, NULL, 'null', 'Orchid Island', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:26'),
(82, 'null', '馬祖七日｜藍眼淚 東莒季節限定 ｜獨木舟體驗夜光團｜ 法藍瓷×馬祖酒廠', 'i-10.jpg', 'null', '4200', NULL, NULL, 'null', 'Matsu', '10', 4, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:33'),
(83, 'null', '台北一日景點 | 遊陽明山國家公園 | 擎天岡 | 淡水老街 | 漁人碼頭', 'n1.jpg', 'null', '1888', NULL, NULL, 'null', 'Taipei', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:40'),
(84, 'null', '新北一日景點遊｜烏來溫泉 | 烏來老街 | 寶藏巖國際藝術村之旅', 'n2.jpg', 'null', '2000', NULL, NULL, 'null', 'Taipei', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:47'),
(85, 'null', '桃園大溪一日景點遊｜揭開後慈湖秘境步道 | 漫遊木藝職人老街 | 彩色海洋奇芋記', 'n3.jpg', 'null', '500', NULL, NULL, 'null', 'Taoyuan', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:50'),
(86, 'null', '拉拉山一日景點遊｜隱藏小木屋前的櫻花祕境 (恩愛農場) | 拉拉山秘境瀑布群', 'n4.jpg', 'null', '1420', NULL, NULL, 'null', 'Taipei', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:43:58'),
(87, 'null', '台北輕旅行一日景點遊｜野柳、十分、九份以及水湳洞陰陽海|黃金瀑布', 'n5.jpg', 'null', '1199', NULL, NULL, 'null', 'Taipei', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:45:58'),
(88, 'null', '蘭陽風光一日景點遊｜國立傳統藝術中心 | 蘭陽博物館|烏石港 | 礁溪溫泉 | 金車咖啡館', 'n6.jpg', 'null', '1300', NULL, NULL, 'null', 'Yilan', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:45:55'),
(89, 'null', '東北角浮潛一日景點遊｜東北角龍洞 SUP立槳+跳水+浮潛', 'n7.jpg', 'null', '1200', NULL, NULL, 'null', 'Taipei', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:44:10'),
(90, 'null', '桃園人文之旅一日景點遊｜大溪齋明寺 | 新建夢幻清水模齋堂建築  |桃園忠烈祠 | 壢景町', 'n8.jpg', 'null', '1888', NULL, NULL, 'null', 'Taoyuan', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-30 02:41:17'),
(91, 'null', '苗栗湖光一日景點遊｜南庄 | 護魚步道 | 向天湖 | 玫瑰森林', 'n9.jpg', 'null', '1720', NULL, NULL, 'null', 'Miaoli ', '12', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:44:19'),
(92, 'null', '嘉義一日景點遊｜阿里山小火車 | 賞櫻花 | 森林鐵路 | 觀光茶園', 'c9.png', 'null', '1908', NULL, NULL, '阿里山目前為國際觀光旅遊景點，日據時期與太平山、八仙山並稱臺灣三大林場。因應阿里山林場檜木資源而闢建阿里山林業鐵路，起點就在嘉義市北門，木材買賣集散為嘉義市帶來前所未有的繁榮，當時更因此列為臺灣四大都市之一。', 'Chiayi', '13', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:44:25'),
(93, 'null', '台灣一日景點遊｜南投 武嶺 和 梨山｜台中市區出發', 'c1.jpg', 'null', '1199', NULL, NULL, '立即預訂南投一日遊，一天之內走遍必去 合歡山武嶺、梨山！帶你從台中市區出發！來到高海拔最夯的打卡聖地 - 武嶺！放眼四周，碧綠的山稜盡在眼底。四季皆有不同風采可欣賞到各式美景，楓葉、櫻花、李花等，花朵的美麗，處處妝點著南投大地。', 'Nantou', '13', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:45:51'),
(94, 'null', '台中一日景點遊｜谷關神木谷飯店溫泉泡湯｜台中市區出發', 't7.jpg', 'null', '1880', NULL, NULL, '立即預訂台中谷關一日遊，由司機帶您從台中市區搭乘舒適專車出發，前往谷關呼吸山林溪谷清新空氣。沿途走訪捎來步道、吊橋及溫泉公園，再到神木谷溫泉飯店享受暖心湯泉、大啖鱒魚套餐，度過療癒又休閒的時光！\n\n專車從台中市區出發，前往谷關一日遊，交通省時又便利\n體驗網友人氣票選前五名、中台灣最古老的溫泉「谷關溫泉」\n品嚐美味的鱒魚套餐，其肉質鮮嫩 Q 彈、無腥味、口感好，讓您的味蕾獲得滿足', 'Taichung', '13', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:44:32'),
(95, 'null', '南投一日景點遊｜杉林溪｜台中市區出發', 'c3.png', 'null', '1000', NULL, NULL, 'null', 'Nantou', '13', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:44:41'),
(96, 'null', '南投一日景點遊｜清境農場｜台中市區出發', 'c4.png', 'null', '1199', NULL, NULL, 'null', 'Nantou', '13', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:45:46'),
(97, 'null', '南投一日景點遊｜夢幻清境高空景觀步道', 'c5.png', 'null', '800', NULL, NULL, 'null', 'Nantou', '13', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:45:43'),
(98, 'null', '高雄一日景點遊｜遠山望月溫泉風呂露營區｜豪華狩獵帳 ｜台中市區出發', 'c6.png', 'null', '1199', NULL, NULL, 'null', 'Kaohsiung', '13', 11, NULL, '2021-08-20 14:17:40', '2021-08-31 14:00:56'),
(99, 'null', '恆春一日景點遊｜鹿境梅花鹿生態園區門票 ｜台中市區出發    ', 'east-35.jpeg', 'null', '599', NULL, NULL, 'null', 'Pingtung', '13', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:04'),
(100, 'null', '宜蘭一日遊｜福山植物園、窯烤山寨村、龍潭湖畔悠活園區', 'east-29.jpeg', 'null', '1320', NULL, NULL, 'null', 'Yilan', '14', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:11'),
(101, 'null', '宜蘭一日遊｜頭城農場農事體驗、外澳伯朗頭城海景咖啡館', 'east-30.jpeg', 'null', '1300', NULL, NULL, 'null', 'Yilan', '14', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:14'),
(102, 'null', '宜蘭一日遊｜安農溪分洪堰、落羽松秘境、長埤湖風景區', 'east-31.jpeg', 'null', '1450', NULL, NULL, 'null', 'Yilan', '14', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:18'),
(103, 'null', '宜蘭一日遊｜積木博物館、噶瑪蘭酒廠、兔子迷宮、望龍埤', 'east-32.jpeg', 'null', '2000', NULL, NULL, 'null', 'Yilan', '14', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:21'),
(104, 'null', '宜蘭一日遊｜宜農牧場、鵝山茶園、梅花湖、龍座咖啡', 'east-33.jpeg', 'null', '1312', NULL, NULL, 'null', 'Yilan', '14', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:27'),
(105, 'null', '宜蘭一日遊｜仁山植物園、林美石磐步道森呼吸', 'east-34.jpeg', 'null', '700', NULL, NULL, 'null', 'Yilan', '14', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:30'),
(106, 'null', '宜蘭一日遊｜中興文創園區、清水地熱公園、明池森林童話', 'east-35.jpeg', 'null', '500', NULL, NULL, 'null', 'Yilan', '14', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:35'),
(107, 'null', '宜蘭一日遊｜出發牛奶湖、龜山島登島、賞鯨、壯圍沙丘', 'east-36.jpeg', 'null', '2230', NULL, NULL, 'null', 'Yilan', '14', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:41'),
(108, 'null', '金門秘境一日遊、夜訪水頭聚落得月樓＆莒光樓', 'east-37.jpeg', 'null', '3122', NULL, NULL, 'null', 'Kinmen', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:47'),
(109, 'null', '小琉球杉板灣一日遊、夜間導覽', 'east-38.jpeg', 'null', '1333', NULL, NULL, 'null', 'Ryukyu', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:52'),
(110, 'null', '金門烈嶼文化深度一日遊', 'east-39.jpeg', 'null', '1999', NULL, NULL, 'null', 'Kinmen', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:46:56'),
(111, 'null', '金門私藏景點包車一日遊', 'east-40.jpeg', 'null', '2300', NULL, NULL, 'null', 'Kinmen', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:00'),
(112, 'null', '澎湖一日景點遊 |  2021 國際海上花火節 | 海上遊船賞煙火', 'p1.png', 'null', '3210', NULL, NULL, 'null', 'Penghu', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:04'),
(113, 'null', '澎湖一日景點遊 | 水族館優惠雙人門票 ', 'p2.png', 'null', '3210', NULL, NULL, 'null', 'Penghu', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:07'),
(114, 'null', '澎湖一日景點遊 | 星光海洋牧場｜鮮烤牡蠣美味粥品吃到飽 ', 'p3.png', 'null', '3888', NULL, NULL, 'null', 'Penghu', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:14'),
(115, 'null', '澎湖一日景點遊 | 七美望安搭船跳島', 'p4.png', 'null', '700', NULL, NULL, 'null', 'Penghu', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:17'),
(116, 'null', '小琉球一日景點遊｜楊光獨木舟 | 透明獨木舟尋找海龜 | 獨木舟體驗團＆夕陽之旅 | 免費拍照', 'c7.png', 'null', '2400', NULL, NULL, 'null', 'Ryukyu', '15', 11, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:21'),
(117, '17', '頭燈【黑】', 'headlamp-black.jpeg', 'null', '0', '120', NULL, '・300流明\n・含電池重量83g\n・3顆AAA鹼性電池\n・5段光線模式\n・可鎖式開關\n・IPX4防水等級', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(118, '17', '頭燈【藍】', 'headlamp-blue.jpg', 'null', '0', '120', NULL, '・300流明\n・含電池重量83g\n・3顆AAA鹼性電池\n・5段光線模式\n・可鎖式開關\n・IPX4防水等級', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-21 15:34:41'),
(119, '17', '頭燈【橘】', 'headlamp-orange.jpeg', 'null', '0', '120', NULL, '・300流明\n・含電池重量83g\n・3顆AAA鹼性電池\n・5段光線模式\n・可鎖式開關\n・IPX4防水等級', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(120, '17', '頭燈【白】', 'headlamp-white.jpeg', 'null', '0', '120', NULL, '・300流明\n・含電池重量83g\n・3顆AAA鹼性電池\n・5段光線模式\n・可鎖式開關\n・IPX4防水等級', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(121, '17', '背包外罩【大】', 'bag-cover.jpg', 'L', '0', '100', NULL, '這款採用聚酯纖維（polyester）塗層布料及防水縫線處理的FORCLAZ防水包套，可保護背包及內容物，避免健行時被雨淋濕。附有一體成型、不會遺失的收納袋。', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:37'),
(122, '17', '背包外罩【小】', 'smbag-cover.jpg', 'S', '0', '100', NULL, '這款採用聚酯纖維（polyester）塗層布料及防水縫線處理的FORCLAZ防水包套，可保護背包及內容物，避免健行時被雨淋濕。附有一體成型、不會遺失的收納袋。', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:39'),
(123, '17', '睡袋【深藍】', 'sleeping-bag-darkblue.jpeg', 'null', '0', '245', NULL, '・羽絨睡袋- 輕量保暖，鴨絨填充。\n・日規 ( JIS ) 90 / 10 --> 90%羽絨 / 10%羽毛 (鴨絨)\n・600 cu.inch/oz 高蓬鬆度。', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(124, '17', '睡袋【藍】', 'sleeping-bag-blue.jpeg', 'null', '0', '245', NULL, '・羽絨睡袋- 輕量保暖，鴨絨填充。\n・日規 ( JIS ) 90 / 10 --> 90%羽絨 / 10%羽毛 (鴨絨)\n・600 cu.inch/oz 高蓬鬆度。', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(125, '17', '睡袋【紅】', 'sleeping-bag-red.jpg', 'null', '0', '245', NULL, '・羽絨睡袋- 輕量保暖，鴨絨填充。\n・日規 ( JIS ) 90 / 10 --> 90%羽絨 / 10%羽毛 (鴨絨)\n・600 cu.inch/oz 高蓬鬆度。', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-21 16:03:42'),
(126, '17', '睡袋【灰】', 'sleeping-bag-gray.jpeg', 'null', '0', '245', NULL, '・羽絨睡袋- 輕量保暖，鴨絨填充。\n・日規 ( JIS ) 90 / 10 --> 90%羽絨 / 10%羽毛 (鴨絨)\n・600 cu.inch/oz 高蓬鬆度。', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-21 16:05:51'),
(127, '17', '雙層保冷噴射水壺【藍】', 'bottle-blue.jpg', 'null', '0', '49', NULL, '・Muckguard噴射水壺專用帽蓋\n・Surge Valve創新的咬嘴專利技術\n・Tri-Layer™ Insulation保冷專利技術\n・Effortless Squeeze可單手輕鬆擠水', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(128, '17', '雙層保冷噴射水壺 【綠】', 'bottle-green.jpg', 'null', '0', '49', NULL, '・Muckguard噴射水壺專用帽蓋\n・Surge Valve創新的咬嘴專利技術\n・Tri-Layer™ Insulation保冷專利技術\n・Effortless Squeeze可單手輕鬆擠水', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(129, '17', '雙層保冷噴射水壺 【灰】', 'bottle-gray.jpg', 'null', '0', '49', NULL, '・Muckguard噴射水壺專用帽蓋\n・Surge Valve創新的咬嘴專利技術\n・Tri-Layer™ Insulation保冷專利技術\n・Effortless Squeeze可單手輕鬆擠水', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(130, '17', '雙層保冷噴射水壺 【墨綠】', 'bottle-linkgreen.jpg', 'null', '0', '49', NULL, '・Muckguard噴射水壺專用帽蓋\n・Surge Valve創新的咬嘴專利技術\n・Tri-Layer™ Insulation保冷專利技術\n・Effortless Squeeze可單手輕鬆擠水', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(131, '17', '野營套鍋組  | 2~3人適用', 'cooking-staffs.jpg', 'null', '0', '120', NULL, '*材質 : 硬質氧化鋁、附贈產品收納袋', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(132, '17', '遮陽帽【橘】', 'hat-orange.jpg', 'null', '0', '60', NULL, '彈性柔軟面料防潑水加工\n裡布保暖天鵝絨材質\n後有鬆緊繩束扣，可微調頭圍鬆緊度\n可拆式可調整鬆緊度頸繩設計\nLogo繡花設計', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(133, '17', '遮陽帽【綠】', 'hat-green.jpg', 'null', '0', '60', NULL, '彈性柔軟面料防潑水加工\n裡布保暖天鵝絨材質\n後有鬆緊繩束扣，可微調頭圍鬆緊度\n可拆式可調整鬆緊度頸繩設計\nLogo繡花設計', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(134, '17', '遮陽帽【黃】', 'hat-yellow.jpg', 'null', '0', '60', NULL, '彈性柔軟面料防潑水加工\n裡布保暖天鵝絨材質\n後有鬆緊繩束扣，可微調頭圍鬆緊度\n可拆式可調整鬆緊度頸繩設計\nLogo繡花設計', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(135, '17', '遮陽帽【白】', 'hat-white.jpg', 'null', '0', '60', NULL, '彈性柔軟面料防潑水加工\n裡布保暖天鵝絨材質\n後有鬆緊繩束扣，可微調頭圍鬆緊度\n可拆式可調整鬆緊度頸繩設計\nLogo繡花設計', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(136, '17', 'Gore-Tex大背包縱走登山鞋【黃】', 'hiking- boots-yellow.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:53'),
(137, '17', 'Gore-Tex大背包縱走登山鞋【藍】', 'hiking-boots-blue.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:47:57'),
(138, '17', 'Gore-Tex大背包縱走登山鞋【灰】', 'hiking-boots-gray.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:00'),
(139, '17', 'Gore-Tex大背包縱走登山鞋【綠】', 'hiking-boots-green.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:04'),
(140, '17', 'Gore-Tex大背包縱走登山鞋【土黃】', 'hiking-boots-khaki.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:07'),
(141, '17', 'Gore-Tex大背包縱走登山鞋【亮藍】', 'hiking-boots-light-blue.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:10'),
(142, '17', 'Gore-Tex大背包縱走登山鞋【條紋】', 'hiking-boots-line.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:12'),
(143, '17', 'Gore-Tex大背包縱走登山鞋【粉紅】', 'hiking-boots-pink.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:15'),
(144, '17', 'Gore-Tex大背包縱走登山鞋【紅】', 'hiking-boots-red.jpg', '35-41 鞋碼', '0', '1800', NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:19'),
(145, '17', '連身套頭式雨衣【藍】', 'rain-coat-blue.jpg', 'S M L', '0', '158', NULL, '*附收納袋方便收納，輕巧、不佔空間\n*抽繩可調整鬆緊，有帽沿設計\n*寬型蝴蝶袖口更靈活\n*防水係數 3000mm', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:22'),
(146, '17', '連身套頭式雨衣【紅】', 'rain-coat-red.jpg', 'S M L', '0', '158', NULL, '*附收納袋方便收納，輕巧、不佔空間\n*抽繩可調整鬆緊，有帽沿設計\n*寬型蝴蝶袖口更靈活\n*防水係數 3000mm', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:27'),
(147, '17', '加長型連身套頭式雨衣【紅】', 'rain-coat-red-long.jpg', 'S M L XL', '0', '162', NULL, '*附收納袋方便收納，輕巧、不佔空間\n*抽繩可調整鬆緊，有帽沿設計\n*寬型蝴蝶袖口更靈活\n*防水係數 3000mm', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:30'),
(148, '17', '保暖帽【黑】', 'wram-hat-black.jpg', 'null', '0', '149', NULL, '*保暖、防水、透氣、輕柔\n*禦寒保暖、登山戶外休閒必備\n*台灣製造．品質保證', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:33'),
(149, '17', '保暖帽【藍】', 'wram-hat-blue.jpg', 'null', '0', '149', NULL, '*保暖、防水、透氣、輕柔\n*禦寒保暖、登山戶外休閒必備\n*台灣製造．品質保證', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:36'),
(150, '17', '保暖帽【灰】', 'wram-hat-gray.jpg', 'null', '0', '149', NULL, '*保暖、防水、透氣、輕柔\n*禦寒保暖、登山戶外休閒必備\n*台灣製造．品質保證', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:39'),
(151, '17', '保暖帽【深藍】', 'wram-hat-dark-blue.jpg', 'null', '0', '149', NULL, '*保暖、防水、透氣、輕柔\n*禦寒保暖、登山戶外休閒必備\n*台灣製造．品質保證', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:41'),
(152, '17', 'Black Diamond Trail 登山杖 ', 'alpenstick.jpg', 'null', '0', '320', NULL, '*360度環狀熱壓腕帶\n*輕量EVA防滑握把延伸至桿身\n*FlickLock快扣設計，方便迅速調節桿身尺寸\n*杖身刻度，依需求調整長度\n*附阻泥板與阻雪板\n*可更換鎢鋼杖尖', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(153, '17', 'Granite Gear 5000136 Perimeter登山健行背包【藍】', 'bag-blue.jpeg', 'null', '0', '600', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(154, '17', 'Granite Gear 5000136 Perimeter登山健行背包【亮藍】', 'bag-light-blue.jpeg', 'null', '0', '600', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(155, '17', 'Granite Gear 5000136 Perimeter登山健行背包【灰】', 'bag-gray.jpeg', 'null', '0', '600', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(156, '17', 'Granite Gear 5000136 Perimeter登山健行背包【白】', 'bag-white-back.jpeg', 'null', '0', '600', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 18, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(157, '17', 'ADISI 魚雷浮標AS17118 【單入】日月潭泳渡必備', 'rescue-tube.jpeg', '119*14.5*7.5CM', '0', '172', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:49'),
(158, '17', 'ADISI 圓筒單肩防水袋【藍色】', 'waterproof-bag-blue.jpeg', 'XXS (最小)', '0', '145', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:52'),
(159, '17', 'ADISI 圓筒單肩防水袋【黃色】', 'waterproof-bag-yellow.jpeg', 'XXS (最小)', '0', '145', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:54'),
(160, '17', 'ADISI 圓筒單肩防水袋【紅色】', 'waterproof-bag-red.jpeg', 'XXS (最小)', '0', '145', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:48:57'),
(161, '17', 'ADISI 圓筒單肩防水袋【粉色】', 'waterproof-bag-pink.jpeg', 'XXS (最小)', '0', '145', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:00'),
(162, '17', 'ADISI女款連身長袖長褲防磨衣', 'water-suite-women.jpeg', 'S~2XL', '0', '118', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(163, '17', 'ADISI男款連身長袖長褲防磨衣', 'water-suite-men.jpeg', 'S~2XL', '0', '118', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(164, '17', 'ADISI雙眼面鏡【黃色】', 'goggles-yellow.jpeg', 'null', '0', '77', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(165, '17', 'ADISI雙眼面鏡【紅色】', 'goggles-red.jpeg', 'null', '0', '77', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(166, '17', 'ADISI雙眼面鏡【藍色】', 'goggles-blue.jpeg', 'null', '0', '77', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(167, '17', 'ADISI 全乾式呼吸管【黑色】', 'snorkel-black.jpeg', 'null', '0', '68', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(168, '17', 'ADISI 全乾式呼吸管【深藍】', 'snorkel-darkblue.jpeg', 'null', '0', '68', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(169, '17', 'ADISI 全乾式呼吸管【水藍色】', 'snorkel-blue.jpeg', 'null', '0', '68', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(170, '17', 'ADISI 全乾式呼吸管【玫紅】', 'snorkel-pink.jpeg', 'null', '0', '68', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(171, '17', 'ADISI 全乾式呼吸管【黃色】', 'snorkel-yellow.jpeg', 'null', '0', '68', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(172, '17', 'SABLE 黑貂 單色矽膠泳帽', 'swimming-cap.jpeg', 'null', '0', '48', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:13'),
(173, '17', 'SABLE黑貂 兒童平光泳鏡', 'child-goggles.jpeg', '2~12 歲兒童', '0', '43', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(174, '17', 'ADISI Neoprenoe浮力背心 【寶藍-黃】', 'vest-front.jpeg', 'S~2XL', '0', '225', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-21 16:13:08'),
(175, '17', 'ADISI Neoprenoe浮力背心 【桃紅-黃】', 'vest-pink-front.jpeg', 'S~2XL', '0', '225', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(176, '17', 'ADISI 仿麂皮毛巾AS15047【30x30cm】', 'towel-blue.jpeg', 'null', '0', '123', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:21'),
(177, '17', 'Lewis N. Clark 旅行防水收納盒(中) ', 'waterproof-red.jpeg', 'M', '0', '60', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(178, '17', 'Lewis N. Clark 旅行防水收納盒(小) ', 'waterproof-yellow.jpeg', 'S', '0', '54', NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(179, '17', 'ADISI WM11 自由潛水雙眼抗反射面鏡', 'goggles-freediving.jpeg', 'null', '0', '120', NULL, '・柔軟裙邊，服貼臉型、平壓捏鼻更容易\n・面鏡帶調節鈕，按鈕式調節閥，按壓即可調整鬆緊\n・黃色反光鏡片，過濾平行光線、防眩光\n・低容積、大鏡面視野更清晰\n・加寬面鏡帶，加寬矽膠帶增加穩定度\n・搭配購買 ADISI 雙色面鏡帶 AS17051，方便穿脫不卡頭髮', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(180, '17', '手機防水袋 (9cm*16cm手機適用) ITIWIT', 'waterproof-bag.jpeg', 'null', '0', '69', NULL, '・水密性/防滲水-採用全密封設計，其抗水性可在水下1 m處達30分鐘：IPX7防水等級2\n・觸覺效果-可使用手機觸控螢幕和拍照功能\n\n', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:27'),
(181, '17', '女童防曬衝浪水母衣 OLAIAN', 'water-proof-top.jpeg', 'S', '0', '1200', NULL, '這款抗UV長袖T恤即使在水中也能防曬，適合女童衝浪時穿著。採用修身剪裁和抽繩設計，可確保衣服在浪中不滑動。', '', NULL, 19, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:32'),
(182, '17', 'GoPro HERO9 Black 超大電量組', 'gopro-front.jpg', 'null', '0', '1300', NULL, '*功能更強，畫面更清晰，影像更穩定。革命性的 HERO9 Black 擁有超震撼的 2,360 萬像素感應器，可拍攝讓人驚嘆的 5K 影片和精美的 2,000 萬像素相片。\n*令人目眩神迷的全新正面顯示器，可供即時預覽，方便構圖；背面大型觸控螢幕搭配觸控變焦功能，提供快速直覺的操控能力。\n*HERO9 Black 提供包括 HindSight 預錄拍攝在內的強大全新系列功能，並*支援即時串流及網路攝影機模式。再加上 HyperSmooth 超強防抖 3.0、內建固定座以及提升 30% 的電池續航力1，在這', '', NULL, 20, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:37'),
(183, '17', 'Marsace XT-15 旅行碳纖維三腳架', 'tripod-set.jpg', 'null', '0', '690', NULL, '★收合直徑僅6.9cm\n★最高高度約144cm\n★載重量高達6kg\n★含雲台自重不到1kg\n★最低工作角度低達14cm\n★最適合旅行的腳架\n★原廠防水拉鍊背袋\n★台灣總代理公司貨', '', NULL, 20, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(184, '17', '雲騰 輕量藍牙自拍三腳架 VCT5208 手機自拍架', 'selfie-stick.jpg', 'null', '0', '79', NULL, '*每次想和朋友們拍合照都要麻煩路人幫忙\n又擔心拍得不好或太少張 真的很困擾\n有了這個三腳架就可以拍到手機記憶體不夠啦\n想要橫拍、豎拍、俯視、仰視各種角度都沒有問題~\n還有360度水平旋轉 可以穩穩地拍全景照呢最高可拉伸到125cm↕ 總共三段高度可以調整\n再也不用擔心想拍全身照 但是會咖掉腳腳了', '', NULL, 20, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(185, '21', '頭燈【黑】', 'headlamp-black.jpeg', 'null', '1200', NULL, NULL, '・300流明\n・含電池重量83g\n・3顆AAA鹼性電池\n・5段光線模式\n・可鎖式開關\n・IPX4防水等級', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:44'),
(186, '21', '頭燈【藍】', 'headlamp-blue.jpg', 'null', '1200', NULL, NULL, '・300流明\n・含電池重量83g\n・3顆AAA鹼性電池\n・5段光線模式\n・可鎖式開關\n・IPX4防水等級', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:48'),
(187, '21', '頭燈【橘】', 'headlamp-orange.jpeg', 'null', '1200', NULL, NULL, '・300流明\n・含電池重量83g\n・3顆AAA鹼性電池\n・5段光線模式\n・可鎖式開關\n・IPX4防水等級', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:50'),
(188, '21', '頭燈【白】', 'headlamp-white.jpeg', 'null', '1200', NULL, NULL, '・300流明\n・含電池重量83g\n・3顆AAA鹼性電池\n・5段光線模式\n・可鎖式開關\n・IPX4防水等級', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:53'),
(189, '21', '背包外罩【大】', 'bag-cover.jpg', 'L', '200', NULL, NULL, '這款採用聚酯纖維（polyester）塗層布料及防水縫線處理的FORCLAZ防水包套，可保護背包及內容物，避免健行時被雨淋濕。附有一體成型、不會遺失的收納袋。', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(190, '21', '背包外罩【小】', 'smbag-cover.jpg', 'S', '150', NULL, NULL, '這款採用聚酯纖維（polyester）塗層布料及防水縫線處理的FORCLAZ防水包套，可保護背包及內容物，避免健行時被雨淋濕。附有一體成型、不會遺失的收納袋。', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(191, '21', '睡袋【深藍】', 'sleeping-bag-darkblue.jpeg', 'null', '2450', NULL, NULL, '・羽絨睡袋- 輕量保暖，鴨絨填充。\n・日規 ( JIS ) 90 / 10 --> 90%羽絨 / 10%羽毛 (鴨絨)\n・600 cu.inch/oz 高蓬鬆度。', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:56'),
(192, '21', '睡袋【藍】', 'sleeping-bag-blue.jpeg', 'null', '2450', NULL, NULL, '・羽絨睡袋- 輕量保暖，鴨絨填充。\n・日規 ( JIS ) 90 / 10 --> 90%羽絨 / 10%羽毛 (鴨絨)\n・600 cu.inch/oz 高蓬鬆度。', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:49:58'),
(193, '21', '睡袋【紅】', 'sleeping-bag-red.jpg', 'null', '2450', NULL, NULL, '・羽絨睡袋- 輕量保暖，鴨絨填充。\n・日規 ( JIS ) 90 / 10 --> 90%羽絨 / 10%羽毛 (鴨絨)\n・600 cu.inch/oz 高蓬鬆度。', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:00'),
(194, '21', '睡袋【灰】', 'sleeping-bag-gray.jpeg', 'null', '2450', NULL, NULL, '・羽絨睡袋- 輕量保暖，鴨絨填充。\n・日規 ( JIS ) 90 / 10 --> 90%羽絨 / 10%羽毛 (鴨絨)\n・600 cu.inch/oz 高蓬鬆度。', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:02'),
(195, '21', '雙層保冷噴射水壺【藍】', 'bottle-blue.jpg', 'null', '490', NULL, NULL, '・Muckguard噴射水壺專用帽蓋\n・Surge Valve創新的咬嘴專利技術\n・Tri-Layer™ Insulation保冷專利技術\n・Effortless Squeeze可單手輕鬆擠水', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(196, '21', '雙層保冷噴射水壺 【綠】', 'bottle-green.jpg', 'null', '490', NULL, NULL, '・Muckguard噴射水壺專用帽蓋\n・Surge Valve創新的咬嘴專利技術\n・Tri-Layer™ Insulation保冷專利技術\n・Effortless Squeeze可單手輕鬆擠水', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(197, '21', '雙層保冷噴射水壺 【灰】', 'bottle-gray.jpg', 'null', '490', NULL, NULL, '・Muckguard噴射水壺專用帽蓋\n・Surge Valve創新的咬嘴專利技術\n・Tri-Layer™ Insulation保冷專利技術\n・Effortless Squeeze可單手輕鬆擠水', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(198, '21', '雙層保冷噴射水壺 【墨綠】', 'bottle-linkgreen.jpg', 'null', '490', NULL, NULL, '・Muckguard噴射水壺專用帽蓋\n・Surge Valve創新的咬嘴專利技術\n・Tri-Layer™ Insulation保冷專利技術\n・Effortless Squeeze可單手輕鬆擠水', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(199, '21', '野營套鍋組  | 2~3人適用', 'cooking-staffs.jpg', 'null', '1163', NULL, NULL, '*材質 : 硬質氧化鋁、附贈產品收納袋', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:06'),
(200, '21', '遮陽帽【橘】', 'hat-orange.jpg', 'null', '616', NULL, NULL, '彈性柔軟面料防潑水加工\n裡布保暖天鵝絨材質\n後有鬆緊繩束扣，可微調頭圍鬆緊度\n可拆式可調整鬆緊度頸繩設計\nLogo繡花設計', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(201, '21', '遮陽帽【綠】', 'hat-green.jpg', 'null', '616', NULL, NULL, '彈性柔軟面料防潑水加工\n裡布保暖天鵝絨材質\n後有鬆緊繩束扣，可微調頭圍鬆緊度\n可拆式可調整鬆緊度頸繩設計\nLogo繡花設計', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(202, '21', '遮陽帽【黃】', 'hat-yellow.jpg', 'null', '616', NULL, NULL, '彈性柔軟面料防潑水加工\n裡布保暖天鵝絨材質\n後有鬆緊繩束扣，可微調頭圍鬆緊度\n可拆式可調整鬆緊度頸繩設計\nLogo繡花設計', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(203, '21', '遮陽帽【白】', 'hat-white.jpg', 'null', '616', NULL, NULL, '彈性柔軟面料防潑水加工\n裡布保暖天鵝絨材質\n後有鬆緊繩束扣，可微調頭圍鬆緊度\n可拆式可調整鬆緊度頸繩設計\nLogo繡花設計', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(204, '21', 'Gore-Tex大背包縱走登山鞋【黃】', 'hiking- boots-yellow.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:11'),
(205, '21', 'Gore-Tex大背包縱走登山鞋【藍】', 'hiking-boots-blue.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:13'),
(206, '21', 'Gore-Tex大背包縱走登山鞋【灰】', 'hiking-boots-gray.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:15'),
(207, '21', 'Gore-Tex大背包縱走登山鞋【綠】', 'hiking-boots-green.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:18'),
(208, '21', 'Gore-Tex大背包縱走登山鞋【土黃】', 'hiking-boots-khaki.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:20'),
(209, '21', 'Gore-Tex大背包縱走登山鞋【亮藍】', 'hiking-boots-light-blue.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:22'),
(210, '21', 'Gore-Tex大背包縱走登山鞋【條紋】', 'hiking-boots-line.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:26'),
(211, '21', 'Gore-Tex大背包縱走登山鞋【粉紅】', 'hiking-boots-pink.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:28'),
(212, '21', 'Gore-Tex大背包縱走登山鞋【紅】', 'hiking-boots-red.jpg', '35-41 鞋碼', '8650', NULL, NULL, '*如果您是在快步行走方面經驗豐富的背包客，那麼這是一雙非常適合您的理想靴子。\n*特殊的雙層中底結構和人體工學鞋墊，提供更強的避震及類似手套的貼合感，可讓您在多日遠足中保持長期舒適度', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:30'),
(213, '21', '連身套頭式雨衣【藍】', 'rain-coat-blue.jpg', 'S M L', '580', NULL, NULL, '*附收納袋方便收納，輕巧、不佔空間\n*抽繩可調整鬆緊，有帽沿設計\n*寬型蝴蝶袖口更靈活\n*防水係數 3000mm', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-23 21:59:32'),
(214, '21', '連身套頭式雨衣【紅】', 'rain-coat-red.jpg', 'S M L', '580', NULL, NULL, '*附收納袋方便收納，輕巧、不佔空間\n*抽繩可調整鬆緊，有帽沿設計\n*寬型蝴蝶袖口更靈活\n*防水係數 3000mm', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-23 21:59:37'),
(215, '21', '加長型連身套頭式雨衣【紅】', 'rain-coat-red-long.jpg', 'S M L XL', '620', NULL, NULL, '*附收納袋方便收納，輕巧、不佔空間\n*抽繩可調整鬆緊，有帽沿設計\n*寬型蝴蝶袖口更靈活\n*防水係數 3000mm', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-23 21:59:40');
INSERT INTO `product` (`id`, `func_name`, `prod_name`, `prod_main_img`, `prod_size`, `prod_price`, `rental_charge`, `rental_day`, `prod_description`, `location`, `feature_id`, `cat_id`, `cat_id_set`, `created_at`, `updated_at`) VALUES
(216, '21', '保暖帽【黑】', 'wram-hat-black.jpg', 'null', '490', NULL, NULL, '*保暖、防水、透氣、輕柔\n*禦寒保暖、登山戶外休閒必備\n*台灣製造．品質保證', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-23 21:59:44'),
(217, '21', '保暖帽【藍】', 'wram-hat-blue.jpg', 'null', '490', NULL, NULL, '*保暖、防水、透氣、輕柔\n*禦寒保暖、登山戶外休閒必備\n*台灣製造．品質保證', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-23 21:59:48'),
(218, '21', '保暖帽【灰】', 'wram-hat-gray.jpg', 'null', '490', NULL, NULL, '*保暖、防水、透氣、輕柔\n*禦寒保暖、登山戶外休閒必備\n*台灣製造．品質保證', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-23 21:59:52'),
(219, '21', '保暖帽【深藍】', 'wram-hat-dark-blue.jpg', 'null', '490', NULL, NULL, '*保暖、防水、透氣、輕柔\n*禦寒保暖、登山戶外休閒必備\n*台灣製造．品質保證', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-23 21:59:55'),
(220, '21', 'Black Diamond Trail 登山杖 ', 'alpenstick.jpg', 'null', '3420', NULL, NULL, '*360度環狀熱壓腕帶\n*輕量EVA防滑握把延伸至桿身\n*FlickLock快扣設計，方便迅速調節桿身尺寸\n*杖身刻度，依需求調整長度\n*附阻泥板與阻雪板\n*可更換鎢鋼杖尖', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:35'),
(221, '21', 'Granite Gear 5000136 Perimeter登山健行背包【藍】', 'bag-blue.jpeg', 'null', '6000', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:37'),
(222, '21', 'Granite Gear 5000136 Perimeter登山健行背包【亮藍】', 'bag-light-blue.jpeg', 'null', '6000', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:40'),
(223, '21', 'Granite Gear 5000136 Perimeter登山健行背包【灰】', 'bag-gray.jpeg', 'null', '6000', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:45'),
(224, '21', 'Granite Gear 5000136 Perimeter登山健行背包【白】', 'bag-white-back.jpeg', 'null', '6000', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 22, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:49'),
(225, '21', 'ADISI 魚雷浮標AS17118 【單入】日月潭泳渡必備', 'rescue-tube.jpeg', '119*14.5*7.5CM', '725', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(226, '21', 'ADISI 圓筒單肩防水袋【藍色】', 'waterproof-bag-blue.jpeg', 'XXS (最小)', '450', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-23 17:53:20'),
(227, '21', 'ADISI 圓筒單肩防水袋【黃色】', 'waterproof-bag-yellow.jpeg', 'XXS (最小)', '450', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-23 17:53:31'),
(228, '21', 'ADISI 圓筒單肩防水袋【紅色】', 'waterproof-bag-red.jpeg', 'XXS (最小)', '450', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-23 17:53:35'),
(229, '21', 'ADISI 圓筒單肩防水袋【粉色】', 'waterproof-bag-pink.jpeg', 'XXS (最小)', '450', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-23 17:53:40'),
(230, '21', 'ADISI女款連身長袖長褲防磨衣', 'water-suite-women.jpeg', 'S~2XL', '1180', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:51'),
(231, '21', 'ADISI男款連身長袖長褲防磨衣', 'water-suite-men.jpeg', 'S~2XL', '1180', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:57'),
(232, '21', 'ADISI雙眼面鏡【黃色】', 'goggles-yellow.jpeg', 'null', '770', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(233, '21', 'ADISI雙眼面鏡【紅色】', 'goggles-red.jpeg', 'null', '770', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(234, '21', 'ADISI雙眼面鏡【藍色】', 'goggles-blue.jpeg', 'null', '770', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(235, '21', 'ADISI 全乾式呼吸管【黑色】', 'snorkel-black.jpeg', 'null', '680', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(236, '21', 'ADISI 全乾式呼吸管【深藍】', 'snorkel-darkblue.jpeg', 'null', '680', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(237, '21', 'ADISI 全乾式呼吸管【水藍色】', 'snorkel-blue.jpeg', 'null', '680', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(238, '21', 'ADISI 全乾式呼吸管【玫紅】', 'snorkel-pink.jpeg', 'null', '680', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(239, '21', 'ADISI 全乾式呼吸管【黃色】', 'snorkel-yellow.jpeg', 'null', '680', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(240, '21', 'SABLE 黑貂 單色矽膠泳帽', 'swimming-cap.jpeg', 'null', '285', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(241, '21', 'SABLE黑貂 兒童平光泳鏡', 'child-goggles.jpeg', '2~12 歲兒童', '430', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(242, '21', 'ADISI Neoprenoe浮力背心 【寶藍-黃】', 'vest-front.jpeg', 'S~2XL', '2250', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-24 20:50:59'),
(243, '21', 'ADISI Neoprenoe浮力背心 【桃紅-黃】', 'vest-pink-front.jpeg', 'S~2XL', '2250', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-24 20:51:02'),
(244, '21', 'ADISI 仿麂皮毛巾AS15047【30x30cm】', 'towel-blue.jpeg', 'null', '200', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-23 17:55:02'),
(245, '21', 'Lewis N. Clark 旅行防水收納盒(中) ', 'waterproof-red.jpeg', 'M', '600', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(246, '21', 'Lewis N. Clark 旅行防水收納盒(小) ', 'waterproof-yellow.jpeg', 'S', '540', NULL, NULL, '*Suspension懸掛背負系統，舒適負重18kg\n*高密度肩帶及可拆卸式胸扣(口哨扣)\n*Re-Fit可調式臀帶，附有撥水拉鍊口袋\n*頂蓋拉鍊隔層，可快速拿取行動中常用的物品 (如頭燈、雨衣等)\n*兩側大面積彈性收納口袋\n*水袋吸管開口、水袋隔間', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(247, '21', 'ADISI WM11 自由潛水雙眼抗反射面鏡', 'goggles-freediving.jpeg', 'null', '1200', NULL, NULL, '・柔軟裙邊，服貼臉型、平壓捏鼻更容易\n・面鏡帶調節鈕，按鈕式調節閥，按壓即可調整鬆緊\n・黃色反光鏡片，過濾平行光線、防眩光\n・低容積、大鏡面視野更清晰\n・加寬面鏡帶，加寬矽膠帶增加穩定度\n・搭配購買 ADISI 雙色面鏡帶 AS17051，方便穿脫不卡頭髮', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-24 20:51:06'),
(248, '21', '手機防水袋 (9cm*16cm手機適用) ITIWIT', 'waterproof-bag.jpeg', 'null', '199', NULL, NULL, '・水密性/防滲水-採用全密封設計，其抗水性可在水下1 m處達30分鐘：IPX7防水等級2\n・觸覺效果-可使用手機觸控螢幕和拍照功能\n\n', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(249, '21', '女童防曬衝浪水母衣 OLAIAN', 'water-proof-top.jpeg', '6-12歲兒童', '399', NULL, NULL, '這款抗UV長袖T恤即使在水中也能防曬，適合女童衝浪時穿著。採用修身剪裁和抽繩設計，可確保衣服在浪中不滑動。', '', NULL, 23, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40'),
(250, '21', 'GoPro HERO9 Black 超大電量組', 'gopro-front.jpg', 'null', '13888', NULL, NULL, '*功能更強，畫面更清晰，影像更穩定。革命性的 HERO9 Black 擁有超震撼的 2,360 萬像素感應器，可拍攝讓人驚嘆的 5K 影片和精美的 2,000 萬像素相片。\n*令人目眩神迷的全新正面顯示器，可供即時預覽，方便構圖；背面大型觸控螢幕搭配觸控變焦功能，提供快速直覺的操控能力。\n*HERO9 Black 提供包括 HindSight 預錄拍攝在內的強大全新系列功能，並*支援即時串流及網路攝影機模式。再加上 HyperSmooth 超強防抖 3.0、內建固定座以及提升 30% 的電池續航力1，在這', '', NULL, 24, NULL, '2021-08-20 14:17:40', '2021-08-24 20:51:12'),
(251, '21', 'Marsace XT-15 旅行碳纖維三腳架', 'tripod-set.jpg', 'null', '6980', NULL, NULL, '★收合直徑僅6.9cm\n★最高高度約144cm\n★載重量高達6kg\n★含雲台自重不到1kg\n★最低工作角度低達14cm\n★最適合旅行的腳架\n★原廠防水拉鍊背袋\n★台灣總代理公司貨', '', NULL, 24, NULL, '2021-08-20 14:17:40', '2021-08-24 20:51:19'),
(252, '21', '雲騰 輕量藍牙自拍三腳架 VCT5208 手機自拍架', 'selfie-stick.jpg', 'null', '798', NULL, NULL, '*每次想和朋友們拍合照都要麻煩路人幫忙\n又擔心拍得不好或太少張 真的很困擾\n有了這個三腳架就可以拍到手機記憶體不夠啦\n想要橫拍、豎拍、俯視、仰視各種角度都沒有問題~\n還有360度水平旋轉 可以穩穩地拍全景照呢最高可拉伸到125cm↕ 總共三段高度可以調整\n再也不用擔心想拍全身照 但是會咖掉腳腳了', '', NULL, 24, NULL, '2021-08-20 14:17:40', '2021-08-20 14:17:40');

-- --------------------------------------------------------

--
-- 資料表結構 `products_comment`
--

CREATE TABLE `products_comment` (
  `id` int(11) NOT NULL COMMENT '流水編號',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `comment` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '評論',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `products_follow`
--

CREATE TABLE `products_follow` (
  `email` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '使用者 E-mail',
  `prod_id` int(11) NOT NULL COMMENT '產品編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '修改時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='商品追蹤';

-- --------------------------------------------------------

--
-- 資料表結構 `products_img`
--

CREATE TABLE `products_img` (
  `id` int(11) NOT NULL COMMENT '流水號',
  `func` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '做什麼用的',
  `filename` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '檔案名稱',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='商品圖片';

--
-- 傾印資料表的資料 `products_img`
--

INSERT INTO `products_img` (`id`, `func`, `filename`, `prod_id`, `created_at`, `updated_at`) VALUES
(1, 'other', 'n14.jpg', 5, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(2, 'other', 'n14-1.jpg', 5, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(3, 'other', 'n14-2.jpg', 5, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(4, 'other', 'n14-3.jpg', 5, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(5, 'other', 'n14-4.jpg', 5, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(6, 'other', 'n15.jpg', 6, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(7, 'other', 'n15-1.jpg', 6, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(8, 'other', 'n15-2.jpg', 6, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(9, 'other', 'n15-3.jpg', 6, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(10, 'other', 'n13.jpg', 28, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(11, 'other', 'n13-1.jpg', 28, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(12, 'other', 'n13-2.jpg', 28, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(13, 'other', 'n1.jpg', 83, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(14, 'other', 'n1-1.jpg', 83, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(15, 'other', 'n1-2.jpg', 83, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(16, 'other', 'n1-3.jpg', 83, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(17, 'other', 'n8.jpg', 90, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(18, 'other', 'n8-1.jpg', 90, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(19, 'other', 'n8-2.jpg', 90, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(20, 'other', 'n2.jpg', 84, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(21, 'other', 'n2-1.jpg', 84, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(22, 'zoom', 'bag-blue.jpeg', 153, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(23, 'zoom', 'bag-blue-back.jpeg', 153, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(24, 'zoom', 'bag-blue-other.jpeg', 153, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(25, 'zoom', 'gopro-front.jpg', 182, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(26, 'zoom', 'gopro.jpg', 182, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(27, 'zoom', 'waterproof-red.jpeg', 177, '2021-08-20 12:56:50', '2021-08-22 10:33:17'),
(28, 'zoom', 'waterproof-inside-red.jpeg', 177, '2021-08-20 12:56:50', '2021-08-22 10:33:21'),
(29, 'zoom', 'waterproof-other-red.jpeg', 177, '2021-08-20 12:56:50', '2021-08-22 10:33:24'),
(30, 'zoom', 'bag-blue.jpeg', 221, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(31, 'zoom', 'bag-blue-back.jpeg', 221, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(32, 'zoom', 'bag-blue-other.jpeg', 221, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(33, 'zoom', 'gopro-front.jpg', 250, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(34, 'zoom', 'gopro.jpg', 250, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(35, 'zoom', 'waterproof-red.jpeg', 245, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(36, 'zoom', 'waterproof-inside-red.jpeg', 245, '2021-08-20 12:56:50', '2021-08-20 12:56:50'),
(37, 'zoom', 'waterproof-other-red.jpeg', 245, '2021-08-20 12:56:50', '2021-08-20 12:56:50');

-- --------------------------------------------------------

--
-- 資料表結構 `reward`
--

CREATE TABLE `reward` (
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `ach_id` varchar(40) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '對應的users成就',
  `prod_name` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品名稱',
  `prod_main_img` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品圖片',
  `achieve` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '成就名稱',
  `prod_description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品敘述',
  `prod_description2` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '詳細規格'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `reward`
--

INSERT INTO `reward` (`prod_id`, `ach_id`, `prod_name`, `prod_main_img`, `achieve`, `prod_description`, `prod_description2`) VALUES
(1, 'ach1', 'LittleChili行李箱套JB4-新環島台灣', 'ach1.jpg', '寶島大師', '多款可愛特色印花<br>\r\n讓您的行李箱辨識度高<br>\r\n彈性材質 可適用各種尺寸行李箱<br>\r\n防塵 防行李箱刮傷<br>\r\n有S M L三種尺寸可選擇', '產地: 中國<br>\r\n材質: 彈性滌綸<br>'),
(2, 'ach2', '幾米鐵道紀念卡', 'ach2.jpg', '蓬萊仙人', '006高雄郵局【台灣郵政紀念卡】--『行旅記憶－幾米鐵道紀念卡』一套六枚', '產地: 中國<br />\r\n材質: 紙<br />'),
(3, 'ach3', '日月潭新八景LED燈傘', 'ach3.jpg', '有龍則靈', '兩段亮燈模式，握把處也可持續亮燈<br>\r\n夜間使用方便，行人使用更為安全<br>\r\n安全圓頭珠尾<br>\r\n台灣福懋布，日月潭新八景圖傘面設計，無毒，不褪色，抗UV', '雨傘規格：23*8K手開直傘<br>\r\n重量約：450g<br>\r\n雨傘最大長度約：78cm<br>\r\n開傘遮蔽直徑約：95cm<br>\r\n傘骨材質：玻璃纖維+LED燈<br>\r\n電池：使用3號電池*'),
(4, 'ach4', 'Coolnet抗UV頭巾-台灣系列-玉山', 'ach4.jpg', '巔峰極限', '單一尺寸約 50-58 cm，四向彈性布高延展性，配戴起來更加舒適服貼。<br>\r\nUPF50+ 織品防曬係數，阻絕約 98% 紫外線。<br>\r\n超輕量比經典頭巾更輕盈 20%。<br>\r\n極速快乾，吸濕排汗，保持清爽。<br>\r\n特殊布料有效蒸散汗水，確實達到降溫涼感。<br>\r\n 95% 回收寶特瓶纖維製成，友善地球。<br>\r\n無接縫設計：防止纖維突出使皮膚搔癢。', '產地：西班牙'),
(5, 'ach5', '榴小妞台灣美食美景隨手曲線杯-平溪天燈', 'ach5.jpg', 'XXX', '榴小妞台灣美食美景隨手曲線杯，透明曲線，好拿好握，輕鬆帶著趴趴走', '尺寸：高17.5cm、杯口直徑7.4cm、杯底直徑5.7cm<br>\r\n容量：350cc<br>\r\n耐溫：-10~80度<br>\r\n材質：塑膠 A.S、P.P<br>\r\n產地：台灣<br>\r\n印刷設計'),
(6, 'ach6', '榴小妞台灣景點珪藻土杯墊－阿里山', 'ach6.jpg', 'XXX', '採用天然珪藻土製成，<br>\r\n能重複使用，實用又環保，<br>\r\n具吸水功能，讓杯上的水珠不外漏，<br>\r\n讓您使用安全又方便。', '尺寸：直徑9 x厚0.8cm<br>\r\n材質：珪藻土<br>\r\n本體顏色：白<br>\r\n本體產地：中國<br>\r\n印刷設計：台灣'),
(7, 'ach7', '國境之南 - 墾丁 | 布見不散帆布地圖', 'ach7.jpg', 'XXX', '暖呼呼的房間角落， 掛著一面藏著獨家記憶的地圖。 或許是記憶中成長的家鄉、 或許是努力過著每一天生活的居所、 或著是回想起來就會不小心洋溢滿滿幸福傻笑的那一趟旅行。 然後決定下次要去的地點，\r\n                        說好了『布見不散。』', '商品材質: 聚酯纖維<br />\r\n製造方式: 機器製造<br />\r\n商品產地: 台灣​'),
(8, 'ach8', '台灣十大景點~花蓮太魯閣~30秒 聲光卡片', 'ach8.jpg', 'XXX', '太魯閣國家公園計畫最早可追溯至日治時期。1937年12月27日，臺灣總督府國立公園委員會公告「次高太魯閣國立公園」成立，包括現今雪山及太魯閣等地，面積達27萬公頃，但因日治時期結束而廢止。至1979年，行政院核定「臺灣地區綜合開發計畫」，指定太魯閣地區、中橫公路大禹嶺、合歡山一帶及蘇花公路為國家公園及國家道路公園，最終於1984年完成界定國家公園範圍。1986年11月12日，太魯閣國家公園計畫正式公告實施，國家公園範圍涵蓋行政區包括花蓮縣秀林鄉、臺中市和平區以及南投縣仁愛鄉。', '商品材質: 紙<br />\r\n製造方式: 機器製造<br />\r\n商品產地: 台灣​'),
(9, 'ach9', '寶島旅人瘋紀念郵票', 'ach9.jpg', '寶島啟程瘋', '以世界美食為主題，推出繽紛與淡彩兩款，每張貼紙上都有燙金，精緻度超高，就連外包裝都是用燙金描圖紙信封，真可謂送禮自用兩相宜呀！<br>\r\n貼心提醒：此款貼紙僅採用郵票造型，不能當郵票使用，郵寄時請記得黏貼中華郵政所發行的郵票喔！', '產地：台灣<br />\r\n尺寸：11 x 9.5cm<br />\r\n材質：燙金貼紙<br />');

-- --------------------------------------------------------

--
-- 資料表結構 `users`
--

CREATE TABLE `users` (
  `email` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'email',
  `pwd` varchar(40) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密碼',
  `first_name` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '姓名',
  `last_name` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '姓氏',
  `birthdate` date DEFAULT NULL COMMENT '生日',
  `country` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '國家',
  `gender` varchar(1) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '性別',
  `phone_number` varchar(15) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '電話號碼',
  `address` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '地址',
  `point` int(11) NOT NULL DEFAULT 2000 COMMENT '點數',
  `ach1` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '成就1',
  `ach2` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '成就2',
  `ach3` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '成就3',
  `ach4` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '成就4',
  `ach5` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT 'completed' COMMENT '成就5',
  `ach6` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '成就6',
  `ach7` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '成就7',
  `ach8` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '成就8',
  `ach9` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT 'completed' COMMENT '成就9',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `users`
--

INSERT INTO `users` (`email`, `pwd`, `first_name`, `last_name`, `birthdate`, `country`, `gender`, `phone_number`, `address`, `point`, `ach1`, `ach2`, `ach3`, `ach4`, `ach5`, `ach6`, `ach7`, `ach8`, `ach9`, `created_at`, `updated_at`) VALUES
('okihanukus@gmail.com', '7e240de74fb1ed08fa08d38063f6a6a91462a815', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2000, NULL, NULL, NULL, 'completed', NULL, NULL, NULL, NULL, 'completed', '2021-09-03 14:00:07', '2021-09-05 18:02:13');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `coupon`
--
ALTER TABLE `coupon`
  ADD PRIMARY KEY (`email`);

--
-- 資料表索引 `omiyage`
--
ALTER TABLE `omiyage`
  ADD PRIMARY KEY (`prod_id`);

--
-- 資料表索引 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `orders_detail`
--
ALTER TABLE `orders_detail`
  ADD PRIMARY KEY (`order_id`,`prod_id`);

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `products_comment`
--
ALTER TABLE `products_comment`
  ADD PRIMARY KEY (`id`,`prod_id`);

--
-- 資料表索引 `products_follow`
--
ALTER TABLE `products_follow`
  ADD PRIMARY KEY (`email`,`prod_id`);

--
-- 資料表索引 `products_img`
--
ALTER TABLE `products_img`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `reward`
--
ALTER TABLE `reward`
  ADD PRIMARY KEY (`prod_id`);

--
-- 資料表索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`email`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=26;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水編號', AUTO_INCREMENT=132;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products_img`
--
ALTER TABLE `products_img`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=38;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
